tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1619_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1619_H_
#define _PIC16LF1619_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTB                         42
#define RB4                           43
#define RB5                           44
#define RB6                           45
#define RB7                           46
#define PORTC                         47
#define RC0                           48
#define RC1                           49
#define RC2                           50
#define RC3                           51
#define RC4                           52
#define RC5                           53
#define RC6                           54
#define RC7                           55
#define PIR1                          56
#define TMR1IF                        57
#define TMR2IF                        58
#define CCP1IF                        59
#define SSP1IF                        60
#define TXIF                          61
#define RCIF                          62
#define ADIF                          63
#define TMR1GIF                       64
#define PIR2                          65
#define CCP2IF                        66
#define TMR4IF                        67
#define TMR6IF                        68
#define BCL1IF                        69
#define C1IF                          70
#define C2IF                          71
#define OSFIF                         72
#define PIR3                          73
#define CLC1IF                        74
#define CLC2IF                        75
#define CLC3IF                        76
#define CLC4IF                        77
#define ZCDIF                         78
#define CWGIF                         79
#define PIR4                          80
#define SMT1IF                        81
#define SMT1PRAIF                     82
#define SMT1PWAIF                     83
#define SMT2IF                        84
#define SMT2PRAIF                     85
#define SMT2PWAIF                     86
#define CRCIF                         87
#define SCANIF                        88
#define PIR5                          89
#define PID1DIF                       90
#define PID1EIF                       91
#define AT1IF                         92
#define TMR5IF                        93
#define TMR5GIF                       94
#define TMR3IF                        95
#define TMR3GIF                       96
#define TMR0                          97
#define TMR1L                         98
#define TMR1H                         99
#define T1CON                         100
#define TMR1ON                        101
#define nT1SYNC                       102
#define T1CKPS0                       103
#define T1CKPS                        104
#define T1CKPS1                       105
#define TMR1CS0                       106
#define TMR1CS                        107
#define TMR1CS1                       108
#define T1GCON                        109
#define T1GSS0                        110
#define T1GSS                         111
#define T1GSS1                        112
#define T1GVAL                        113
#define T1GGO_nDONE                   114
#define T1GSPM                        115
#define T1GTM                         116
#define T1GPOL                        117
#define TMR1GE                        118
#define T2TMR                         119
#define TMR2                          120
#define T2TMR_TMR                     121
#define T2PR                          122
#define T2PR_PR                       123
#define T2CON                         124
#define T2OUTPS0                      125
#define T2CON_OUTPS0                  126
#define T2OUTPS                       127
#define T2CON_OUTPS                   128
#define T2OUTPS1                      129
#define T2CON_OUTPS1                  130
#define T2OUTPS2                      131
#define T2CON_OUTPS2                  132
#define T2OUTPS3                      133
#define T2CON_OUTPS3                  134
#define T2CKPS0                       135
#define T2CON_CKPS                    136
#define T2CKPS                        137
#define T2CON_CKPS0                   138
#define T2CKPS1                       139
#define T2CON_CKPS1                   140
#define T2CKPS2                       141
#define T2CON_CKPS2                   142
#define T2CON_ON                      143
#define TMR2ON                        144
#define T2ON                          145
#define T2HLT                         146
#define T2HLT_MODE                    147
#define T2MODE                        148
#define T2MODE0                       149
#define T2HLT_MODE0                   150
#define T2MODE1                       151
#define T2HLT_MODE1                   152
#define T2MODE2                       153
#define T2HLT_MODE2                   154
#define T2MODE3                       155
#define T2HLT_MODE3                   156
#define T2MODE4                       157
#define T2HLT_MODE4                   158
#define T2HLT_CKSYNC                  159
#define T2CKSYNC                      160
#define T2HLT_CKPOL                   161
#define T2CKPOL                       162
#define T2PSYNC                       163
#define T2HLT_PSYNC                   164
#define T2CLKCON                      165
#define T2CS                          166
#define T2CS0                         167
#define T2CLKCON_CS                   168
#define T2CLKCON_CS0                  169
#define T2CS1                         170
#define T2CLKCON_CS1                  171
#define T2CS2                         172
#define T2CLKCON_CS2                  173
#define T2CS3                         174
#define T2CLKCON_CS3                  175
#define T2RST                         176
#define T2RSEL0                       177
#define T2RST_RSEL                    178
#define T2RSEL                        179
#define T2RST_RSEL0                   180
#define T2RSEL1                       181
#define T2RST_RSEL1                   182
#define T2RST_RSEL2                   183
#define T2RSEL2                       184
#define T2RSEL3                       185
#define T2RST_RSEL3                   186
#define TRISA                         187
#define TRISA0                        188
#define TRISA1                        189
#define TRISA2                        190
#define TRISA3                        191
#define TRISA4                        192
#define TRISA5                        193
#define TRISB                         194
#define TRISB4                        195
#define TRISB5                        196
#define TRISB6                        197
#define TRISB7                        198
#define TRISC                         199
#define TRISC0                        200
#define TRISC1                        201
#define TRISC2                        202
#define TRISC3                        203
#define TRISC4                        204
#define TRISC5                        205
#define TRISC6                        206
#define TRISC7                        207
#define PIE1                          208
#define TMR1IE                        209
#define TMR2IE                        210
#define CCP1IE                        211
#define SSP1IE                        212
#define TXIE                          213
#define RCIE                          214
#define ADIE                          215
#define TMR1GIE                       216
#define PIE2                          217
#define CCP2IE                        218
#define TMR4IE                        219
#define TMR6IE                        220
#define BCL1IE                        221
#define C1IE                          222
#define C2IE                          223
#define OSCFIE                        224
#define PIE3                          225
#define CLC1IE                        226
#define CLC2IE                        227
#define CLC3IE                        228
#define CLC4IE                        229
#define ZCDIE                         230
#define CWGIE                         231
#define PIE4                          232
#define SMT1IE                        233
#define SMT1PRAIE                     234
#define SMT1PWAIE                     235
#define SMT2IE                        236
#define SMT2PRAIE                     237
#define SMT2PWAIE                     238
#define CRCIE                         239
#define SCANIE                        240
#define PIE5                          241
#define PID1DIE                       242
#define PID1EIE                       243
#define AT1IE                         244
#define TMR5IE                        245
#define TMR5GIE                       246
#define TMR3IE                        247
#define TMR3GIE                       248
#define OPTION_REG                    249
#define OPTION_REG_PS                 250
#define OPTION_REG_PS0                251
#define OPTION_REG_PS1                252
#define PS2                           253
#define PSA                           254
#define T0SE                          255
#define TMR0SE                        256
#define T0CS                          257
#define TMR0CS                        258
#define INTEDG                        259
#define nWPUEN                        260
#define PCON                          261
#define nBOR                          262
#define nPOR                          263
#define nRI                           264
#define nRMCLR                        265
#define nRWDT                         266
#define nWDTWV                        267
#define STKUNF                        268
#define STKOVF                        269
#define OSCTUNE                       270
#define TUN0                          271
#define TUN                           272
#define TUN1                          273
#define TUN2                          274
#define TUN3                          275
#define TUN4                          276
#define TUN5                          277
#define OSCCON                        278
#define SCS0                          279
#define SCS                           280
#define SCS1                          281
#define IRCF                          282
#define IRCF0                         283
#define IRCF1                         284
#define IRCF2                         285
#define IRCF3                         286
#define SPLLEN                        287
#define OSCSTAT                       288
#define HFIOFS                        289
#define LFIOFR                        290
#define MFIOFR                        291
#define HFIOFL                        292
#define HFIOFR                        293
#define OSTS                          294
#define PLLR                          295
#define ADRESL                        296
#define ADRESH                        297
#define ADCON0                        298
#define ADON                          299
#define GO_nDONE                      300
#define GO                            301
#define ADGO                          302
#define CHS0                          303
#define CHS                           304
#define CHS1                          305
#define CHS2                          306
#define CHS3                          307
#define CHS4                          308
#define ADCON1                        309
#define ADPREF0                       310
#define ADPREF                        311
#define ADPREF1                       312
#define ADCS0                         313
#define ADCS                          314
#define ADCS1                         315
#define ADCS2                         316
#define ADFM                          317
#define ADCON2                        318
#define TRIGSEL                       319
#define TRIGSEL0                      320
#define TRIGSEL1                      321
#define TRIGSEL2                      322
#define TRIGSEL3                      323
#define LATA                          324
#define LATA0                         325
#define LATA1                         326
#define LATA2                         327
#define LATA3                         328
#define LATA4                         329
#define LATA5                         330
#define LATB                          331
#define LATB4                         332
#define LATB5                         333
#define LATB6                         334
#define LATB7                         335
#define LATC                          336
#define LATC0                         337
#define LATC1                         338
#define LATC2                         339
#define LATC3                         340
#define LATC4                         341
#define LATC5                         342
#define LATC6                         343
#define LATC7                         344
#define CM1CON0                       345
#define C1SYNC                        346
#define C1HYS                         347
#define C1SP                          348
#define C1POL                         349
#define C1OUT                         350
#define C1ON                          351
#define CM1CON1                       352
#define C1NCH0                        353
#define C1NCH                         354
#define C1NCH1                        355
#define C1NCH2                        356
#define C1PCH                         357
#define C1PCH0                        358
#define C1PCH1                        359
#define C1INTN                        360
#define C1INTP                        361
#define CM2CON0                       362
#define C2SYNC                        363
#define C2HYS                         364
#define C2SP                          365
#define C2POL                         366
#define C2OUT                         367
#define C2ON                          368
#define CM2CON1                       369
#define C2NCH0                        370
#define C2NCH                         371
#define C2NCH1                        372
#define C2NCH2                        373
#define C2PCH                         374
#define C2PCH0                        375
#define C2PCH1                        376
#define C2INTN                        377
#define C2INTP                        378
#define CMOUT                         379
#define MC1OUT                        380
#define MC2OUT                        381
#define BORCON                        382
#define BORRDY                        383
#define BORFS                         384
#define SBOREN                        385
#define FVRCON                        386
#define ADFVR0                        387
#define ADFVR                         388
#define ADFVR1                        389
#define CDAFVR                        390
#define CDAFVR0                       391
#define CDAFVR1                       392
#define TSRNG                         393
#define TSEN                          394
#define FVRRDY                        395
#define FVREN                         396
#define DAC1CON0                      397
#define DAC1PSS                       398
#define D1PSS0                        399
#define D1PSS1                        400
#define DAC1OE                        401
#define DAC1EN                        402
#define DAC1CON1                      403
#define DAC1R                         404
#define DAC1R0                        405
#define DAC1R1                        406
#define DAC1R2                        407
#define DAC1R3                        408
#define DAC1R4                        409
#define DAC1R5                        410
#define DAC1R6                        411
#define DAC1R7                        412
#define ZCD1CON                       413
#define ZCD1INTN                      414
#define ZCD1INTP                      415
#define ZCD1POL                       416
#define ZCD1OUT                       417
#define ZCD1EN                        418
#define ANSA0                         419
#define ANSELA                        420
#define ANSA1                         421
#define ANSA2                         422
#define ANSA4                         423
#define ANSELB                        424
#define ANSB4                         425
#define ANSB5                         426
#define ANSB6                         427
#define ANSB7                         428
#define ANSC0                         429
#define ANSELC                        430
#define ANSC1                         431
#define ANSC2                         432
#define ANSC3                         433
#define ANSC6                         434
#define ANSC7                         435
#define PMADRL                        436
#define PMADRH                        437
#define PMDATL                        438
#define PMDATH                        439
#define PMCON1                        440
#define RD                            441
#define WR                            442
#define WREN                          443
#define WRERR                         444
#define FREE                          445
#define LWLO                          446
#define CFGS                          447
#define PMCON2                        448
#define RC1REG                        449
#define TX1REG                        450
#define SP1BRGL                       451
#define SP1BRGH                       452
#define RC1STA                        453
#define RX9D                          454
#define OERR                          455
#define FERR                          456
#define ADDEN                         457
#define CREN                          458
#define SREN                          459
#define RX9                           460
#define SPEN                          461
#define TX1STA                        462
#define TX9D                          463
#define TRMT                          464
#define BRGH                          465
#define SENDB                         466
#define SYNC                          467
#define TXEN                          468
#define TX9                           469
#define CSRC                          470
#define BAUD1CON                      471
#define ABDEN                         472
#define WUE                           473
#define BRG16                         474
#define SCKP                          475
#define RCIDL                         476
#define ABDOVF                        477
#define WPUA                          478
#define WPUA0                         479
#define WPUA_WPUA                     480
#define WPUA1                         481
#define WPUA2                         482
#define WPUA3                         483
#define WPUA4                         484
#define WPUA5                         485
#define WPUB                          486
#define WPUB4                         487
#define WPUB5                         488
#define WPUB6                         489
#define WPUB7                         490
#define WPUC                          491
#define WPUC0                         492
#define WPUC_WPUA                     493
#define WPUC1                         494
#define WPUC2                         495
#define WPUC3                         496
#define WPUC4                         497
#define WPUC5                         498
#define WPUC6                         499
#define WPUC7                         500
#define SSP1BUF                       501
#define BUF                           502
#define BUF0                          503
#define SSP1BUF0                      504
#define BUF1                          505
#define SSP1BUF1                      506
#define BUF2                          507
#define SSP1BUF2                      508
#define BUF3                          509
#define SSP1BUF3                      510
#define BUF4                          511
#define SSP1BUF4                      512
#define BUF5                          513
#define SSP1BUF5                      514
#define BUF6                          515
#define SSP1BUF6                      516
#define BUF7                          517
#define SSP1BUF7                      518
#define ADD0                          519
#define ADD                           520
#define SSP1ADD0                      521
