tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1619_tdd.h
#define SSP1ADD                       522
#define ADD1                          523
#define SSP1ADD1                      524
#define ADD2                          525
#define SSP1ADD2                      526
#define ADD3                          527
#define SSP1ADD3                      528
#define ADD4                          529
#define SSP1ADD4                      530
#define ADD5                          531
#define SSP1ADD5                      532
#define ADD6                          533
#define SSP1ADD6                      534
#define ADD7                          535
#define SSP1ADD7                      536
#define SSP1MSK0                      537
#define SSP1MSK                       538
#define MSK0                          539
#define MSK                           540
#define SSP1MSK1                      541
#define MSK1                          542
#define SSP1MSK2                      543
#define MSK2                          544
#define SSP1MSK3                      545
#define MSK3                          546
#define SSP1MSK4                      547
#define MSK4                          548
#define SSP1MSK5                      549
#define MSK5                          550
#define SSP1MSK6                      551
#define MSK6                          552
#define SSP1MSK7                      553
#define MSK7                          554
#define SSP1STAT                      555
#define BF                            556
#define UA                            557
#define R_nW                          558
#define S                             559
#define P                             560
#define D_nA                          561
#define CKE                           562
#define SMP                           563
#define SSP1CON1                      564
#define SSPM0                         565
#define SSPM                          566
#define SSPM1                         567
#define SSPM2                         568
#define SSPM3                         569
#define CKP                           570
#define SSPEN                         571
#define SSPOV                         572
#define WCOL                          573
#define SSP1CON2                      574
#define SSP1CON2_SEN                  575
#define RSEN                          576
#define PEN                           577
#define RCEN                          578
#define ACKEN                         579
#define ACKDT                         580
#define ACKSTAT                       581
#define GCEN                          582
#define SSP1CON3                      583
#define DHEN                          584
#define AHEN                          585
#define SBCDE                         586
#define SDAHT                         587
#define BOEN                          588
#define SCIE                          589
#define PCIE                          590
#define ACKTIM                        591
#define ODCONA                        592
#define ODA0                          593
#define ODA1                          594
#define ODA2                          595
#define ODA4                          596
#define ODA5                          597
#define ODCONB                        598
#define ODB4                          599
#define ODB5                          600
#define ODB6                          601
#define ODB7                          602
#define ODCONC                        603
#define ODC0                          604
#define ODC1                          605
#define ODC2                          606
#define ODC3                          607
#define ODC4                          608
#define ODC5                          609
#define ODC6                          610
#define ODC7                          611
#define CCPR1L                        612
#define CCPR1L_RL                     613
#define CCPR1H                        614
#define CCPR1H_RH                     615
#define CCP1CON                       616
#define CCP1MODE0                     617
#define CCP1CON_MODE0                 618
#define CCP1CON_MODE                  619
#define CCP1MODE                      620
#define CCP1MODE1                     621
#define CCP1CON_MODE1                 622
#define CCP1MODE2                     623
#define CCP1CON_MODE2                 624
#define CCP1MODE3                     625
#define CCP1CON_MODE3                 626
#define CCP1CON_FMT                   627
#define CCP1FMT                       628
#define CCP1CON_OUT                   629
#define CCP1OUT                       630
#define CCP1EN                        631
#define CCP1CON_EN                    632
#define CCP1CAP                       633
#define CCP1CTS0                      634
#define CCP1CAP_CTS                   635
#define CCP1CAP_CTS0                  636
#define CCP1CTS                       637
#define CCP1CTS1                      638
#define CCP1CAP_CTS1                  639
#define CCP1CTS2                      640
#define CCP1CAP_CTS2                  641
#define CCPR2L                        642
#define CCPR2L_RL                     643
#define CCPR2H                        644
#define CCPR2H_RH                     645
#define CCP2CON                       646
#define CCP2MODE                      647
#define CCP2MODE0                     648
#define CCP2CON_MODE0                 649
#define CCP2CON_MODE                  650
#define CCP2MODE1                     651
#define CCP2CON_MODE1                 652
#define CCP2MODE2                     653
#define CCP2CON_MODE2                 654
#define CCP2MODE3                     655
#define CCP2CON_MODE3                 656
#define CCP2FMT                       657
#define CCP2CON_FMT                   658
#define CCP2OUT                       659
#define CCP2CON_OUT                   660
#define CCP2EN                        661
#define CCP2CON_EN                    662
#define CCP2CAP                       663
#define CCP2CAP_CTS                   664
#define CCP2CAP_CTS0                  665
#define CCP2CTS                       666
#define CCP2CTS0                      667
#define CCP2CAP_CTS1                  668
#define CCP2CTS1                      669
#define CCP2CAP_CTS2                  670
#define CCP2CTS2                      671
#define CCPTMRS                       672
#define CCP1TSEL0                     673
#define CCP1TSEL                      674
#define CCP1TSEL1                     675
#define CCP2TSEL0                     676
#define CCP2TSEL                      677
#define CCP2TSEL1                     678
#define P3TSEL                        679
#define P3TSEL0                       680
#define P3TSEL1                       681
#define P4TSEL0                       682
#define P4TSEL                        683
#define P4TSEL1                       684
#define SLRCONA                       685
#define SLRA0                         686
#define SLRA1                         687
#define SLRA2                         688
#define SLRA4                         689
#define SLRA5                         690
#define SLRCONB                       691
#define SLRB4                         692
#define SLRB5                         693
#define SLRB6                         694
#define SLRB7                         695
#define SLRCONC                       696
#define SLRC0                         697
#define SLRC1                         698
#define SLRC2                         699
#define SLRC3                         700
#define SLRC4                         701
#define SLRC5                         702
#define SLRC6                         703
#define SLRC7                         704
#define INLVLA                        705
#define INLVLA0                       706
#define INLVLA1                       707
#define INLVLA2                       708
#define INLVLA3                       709
#define INLVLA4                       710
#define INLVLA5                       711
#define INLVLB                        712
#define INLVLB4                       713
#define INLVLB5                       714
#define INLVLB6                       715
#define INLVLB7                       716
#define INLVLC                        717
#define INLVLC0                       718
#define INLVLC1                       719
#define INLVLC2                       720
#define INLVLC3                       721
#define INLVLC4                       722
#define INLVLC5                       723
#define INLVLC6                       724
#define INLVLC7                       725
#define IOCAP                         726
#define IOCAP0                        727
#define IOCAP1                        728
#define IOCAP2                        729
#define IOCAP3                        730
#define IOCAP4                        731
#define IOCAP5                        732
#define IOCAN0                        733
#define IOCAN                         734
#define IOCAN1                        735
#define IOCAN2                        736
#define IOCAN3                        737
#define IOCAN4                        738
#define IOCAN5                        739
#define IOCAF0                        740
#define IOCAF                         741
#define IOCAF1                        742
#define IOCAF2                        743
#define IOCAF3                        744
#define IOCAF4                        745
#define IOCAF5                        746
#define IOCBP                         747
#define IOCBP4                        748
#define IOCBP5                        749
#define IOCBP6                        750
#define IOCBP7                        751
#define IOCBN                         752
#define IOCBN4                        753
#define IOCBN5                        754
#define IOCBN6                        755
#define IOCBN7                        756
#define IOCBF                         757
#define IOCBF4                        758
#define IOCBF5                        759
#define IOCBF6                        760
#define IOCBF7                        761
#define IOCCP                         762
#define IOCCP0                        763
#define IOCCP1                        764
#define IOCCP2                        765
#define IOCCP3                        766
#define IOCCP4                        767
#define IOCCP5                        768
#define IOCCP6                        769
#define IOCCP7                        770
#define IOCCN                         771
#define IOCCN0                        772
#define IOCCN1                        773
#define IOCCN2                        774
#define IOCCN3                        775
#define IOCCN4                        776
#define IOCCN5                        777
#define IOCCN6                        778
#define IOCCN7                        779
#define IOCCF                         780
#define IOCCF0                        781
#define IOCCF1                        782
#define IOCCF2                        783
#define IOCCF3                        784
#define IOCCF4                        785
#define IOCCF5                        786
#define IOCCF6                        787
#define IOCCF7                        788
#define HDRVC                         789
#define HIDC4                         790
#define HIDC5                         791
#define T4TMR                         792
#define TMR4                          793
#define T4TMR_TMR                     794
#define T4PR_PR                       795
#define T4PR                          796
#define T4CON                         797
#define T4OUTPS0                      798
#define T4CON_OUTPS                   799
#define T4OUTPS                       800
#define T4CON_OUTPS0                  801
#define T4OUTPS1                      802
#define T4CON_OUTPS1                  803
#define T4CON_OUTPS2                  804
#define T4OUTPS2                      805
#define T4OUTPS3                      806
#define T4CON_OUTPS3                  807
#define T4CON_CKPS0                   808
#define T4CKPS0                       809
#define T4CON_CKPS                    810
#define T4CKPS                        811
#define T4CKPS1                       812
#define T4CON_CKPS1                   813
#define T4CKPS2                       814
#define T4CON_CKPS2                   815
#define T4ON                          816
#define T4CON_ON                      817
#define TMR4ON                        818
#define T4HLT                         819
#define T4MODE                        820
#define T4HLT_MODE                    821
#define T4HLT_MODE0                   822
#define T4MODE0                       823
#define T4HLT_MODE1                   824
#define T4MODE1                       825
#define T4HLT_MODE2                   826
#define T4MODE2                       827
#define T4HLT_MODE3                   828
#define T4MODE3                       829
#define T4HLT_MODE4                   830
#define T4MODE4                       831
#define T4CKSYNC                      832
#define T4HLT_CKSYNC                  833
#define T4HLT_CKPOL                   834
#define T4CKPOL                       835
#define T4PSYNC                       836
#define T4HLT_PSYNC                   837
#define T4CLKCON                      838
#define T4CS                          839
#define T4CLKCON_CS                   840
#define T4CS0                         841
#define T4CLKCON_CS0                  842
#define T4CS1                         843
#define T4CLKCON_CS1                  844
#define T4CS2                         845
#define T4CLKCON_CS2                  846
#define T4CS3                         847
#define T4CLKCON_CS3                  848
#define T4RST                         849
#define T4RSEL0                       850
#define T4RSEL                        851
#define T4RST_RSEL                    852
#define T4RST_RSEL0                   853
#define T4RSEL1                       854
#define T4RST_RSEL1                   855
#define T4RSEL2                       856
#define T4RST_RSEL2                   857
#define T4RSEL3                       858
#define T4RST_RSEL3                   859
#define T6TMR                         860
#define TMR6                          861
#define T6TMR_TMR                     862
#define T6PR_PR                       863
#define T6PR                          864
#define T6CON                         865
#define T6CON_OUTPS0                  866
#define T6OUTPS                       867
#define T6CON_OUTPS                   868
#define T6OUTPS0                      869
#define T6CON_OUTPS1                  870
#define T6OUTPS1                      871
#define T6CON_OUTPS2                  872
#define T6OUTPS2                      873
#define T6CON_OUTPS3                  874
#define T6OUTPS3                      875
#define T6CON_CKPS0                   876
#define T6CKPS                        877
#define T6CKPS0                       878
#define T6CON_CKPS                    879
#define T6CON_CKPS1                   880
#define T6CKPS1                       881
#define T6CON_CKPS2                   882
#define T6CKPS2                       883
#define TMR6ON                        884
#define T6ON                          885
#define T6CON_ON                      886
#define T6HLT                         887
#define T6MODE0                       888
#define T6HLT_MODE0                   889
#define T6HLT_MODE                    890
#define T6MODE                        891
#define T6HLT_MODE1                   892
#define T6MODE1                       893
#define T6HLT_MODE2                   894
#define T6MODE2                       895
#define T6HLT_MODE3                   896
#define T6MODE3                       897
#define T6MODE4                       898
#define T6HLT_MODE4                   899
#define T6CKSYNC                      900
#define T6HLT_CKSYNC                  901
#define T6CKPOL                       902
#define T6HLT_CKPOL                   903
#define T6PSYNC                       904
#define T6HLT_PSYNC                   905
#define T6CLKCON                      906
#define T6CS                          907
#define T6CLKCON_CS                   908
#define T6CLKCON_CS0                  909
#define T6CS0                         910
#define T6CLKCON_CS1                  911
#define T6CS1                         912
#define T6CLKCON_CS2                  913
#define T6CS2                         914
#define T6CLKCON_CS3                  915
#define T6CS3                         916
#define T6RST                         917
#define T6RST_RSEL                    918
#define T6RST_RSEL0                   919
#define T6RSEL                        920
#define T6RSEL0                       921
#define T6RST_RSEL1                   922
#define T6RSEL1                       923
#define T6RSEL2                       924
#define T6RST_RSEL2                   925
#define T6RST_RSEL3                   926
#define T6RSEL3                       927
#define TMR3L                         928
#define TMR3H                         929
#define T3CON                         930
#define TMR3ON                        931
#define T3SYNC                        932
#define T3CKPS                        933
#define T3CKPS0                       934
#define T3CKPS1                       935
#define TMR3CS0                       936
#define TMR3CS                        937
#define TMR3CS1                       938
#define T3GCON                        939
#define T3GSS0                        940
#define T3GSS                         941
#define T3GSS1                        942
#define T3GVAL                        943
#define T3GGO_nDONE                   944
#define T3GSPM                        945
#define T3GTM                         946
#define T3GPOL                        947
#define TMR3GE                        948
#define TMR5L                         949
#define TMR5H                         950
#define T5CON                         951
#define TMR5ON                        952
#define T5SYNC                        953
#define T5CKPS                        954
#define T5CKPS0                       955
#define T5CKPS1                       956
#define TMR5CS0                       957
#define TMR5CS                        958
#define TMR5CS1                       959
#define T5GCON                        960
#define T5GSS                         961
#define T5GSS0                        962
#define T5GSS1                        963
#define T5GVAL                        964
#define T5GGO_nDONE                   965
#define T5GSPM                        966
#define T5GTM                         967
#define T5GPOL                        968
#define TMR5GE                        969
#define PID1SETL                      970
#define PID1SET0                      971
#define SET0                          972
#define PID1SET1                      973
#define SET1                          974
#define SET2                          975
#define PID1SET2                      976
#define SET3                          977
#define PID1SET3                      978
#define SET4                          979
#define PID1SET4                      980
#define SET5                          981
#define PID1SET5                      982
#define SET6                          983
#define PID1SET6                      984
#define SET7                          985
#define PID1SET7                      986
#define PID1SETH                      987
#define SET8                          988
#define PID1SET8                      989
#define SET9                          990
#define PID1SET9                      991
#define SET10                         992
#define PID1SET10                     993
#define SET11                         994
#define PID1SET11                     995
#define SET12                         996
#define PID1SET12                     997
#define SET13                         998
#define PID1SET13                     999
#define SET14                         1000
#define PID1SET14                     1001
#define SET15                         1002
#define PID1SET15                     1003
#define PID1INL                       1004
#define IN0                           1005
#define PID1IN0                       1006
#define IN1                           1007
#define PID1IN1                       1008
#define IN2                           1009
#define PID1IN2                       1010
#define IN3                           1011
#define PID1IN3                       1012
#define IN4                           1013
#define PID1IN4                       1014
#define IN5                           1015
#define PID1IN5                       1016
#define IN6                           1017
#define PID1IN6                       1018
#define IN7                           1019
#define PID1IN7                       1020
#define PID1INH                       1021
#define IN8                           1022
#define PID1IN8                       1023
#define IN9                           1024
#define PID1IN9                       1025
#define PID1IN10                      1026
#define IN10                          1027
#define PID1IN11                      1028
#define IN11                          1029
#define PID1IN12                      1030
#define IN12                          1031
#define PID1IN13                      1032
#define IN13                          1033
#define PID1IN14                      1034
#define IN14                          1035
#define IN15                          1036
#define PID1IN15                      1037
#define PID1K1L                       1038
#define K10                           1039
#define PID1K10                       1040
#define K11                           1041
#define PID1K11                       1042
#define K12                           1043
#define PID1K12                       1044
#define K13                           1045
#define PID1K13                       1046
#define K14                           1047
#define PID1K14                       1048
#define K15                           1049
#define PID1K15                       1050
#define K16                           1051
#define PID1K16                       1052
#define K17                           1053
#define PID1K17                       1054
#define PID1K1H                       1055
#define K18                           1056
#define PID1K18                       1057
#define K19                           1058
#define PID1K19                       1059
#define PID1K110                      1060
#define K110                          1061
#define PID1K111                      1062
#define K111                          1063
#define PID1K112                      1064
#define K112                          1065
#define PID1K113                      1066
#define K113                          1067
#define PID1K114                      1068
#define K114                          1069
#define PID1K115                      1070
#define K115                          1071
#define PID1K2L                       1072
#define K20                           1073
#define PID1K20                       1074
#define K21                           1075
#define PID1K21                       1076
#define K22                           1077
#define PID1K22                       1078
#define K23                           1079
#define PID1K23                       1080
#define K24                           1081
#define PID1K24                       1082
#define K25                           1083
#define PID1K25                       1084
#define K26                           1085
#define PID1K26                       1086
#define K27                           1087
#define PID1K27                       1088
#define PID1K2H                       1089
#define K28                           1090
