tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1619_tdd.h
#define PID1K28                       1091
#define K29                           1092
#define PID1K29                       1093
#define PID1K210                      1094
#define K210                          1095
#define PID1K211                      1096
#define K211                          1097
#define PID1K212                      1098
#define K212                          1099
#define PID1K213                      1100
#define K213                          1101
#define PID1K214                      1102
#define K214                          1103
#define PID1K215                      1104
#define K215                          1105
#define PID1K3L                       1106
#define K30                           1107
#define PID1K30                       1108
#define K31                           1109
#define PID1K31                       1110
#define K32                           1111
#define PID1K32                       1112
#define K33                           1113
#define PID1K33                       1114
#define K34                           1115
#define PID1K34                       1116
#define K35                           1117
#define PID1K35                       1118
#define K36                           1119
#define PID1K36                       1120
#define K37                           1121
#define PID1K37                       1122
#define PID1K3H                       1123
#define K38                           1124
#define PID1K38                       1125
#define PID1K39                       1126
#define K39                           1127
#define K310                          1128
#define PID1K310                      1129
#define K311                          1130
#define PID1K311                      1131
#define K312                          1132
#define PID1K312                      1133
#define K313                          1134
#define PID1K313                      1135
#define K314                          1136
#define PID1K314                      1137
#define K315                          1138
#define PID1K315                      1139
#define PID1OUTLL                     1140
#define OUT0                          1141
#define PID1OUT0                      1142
#define OUT1                          1143
#define PID1OUT1                      1144
#define OUT2                          1145
#define PID1OUT2                      1146
#define OUT3                          1147
#define PID1OUT3                      1148
#define OUT4                          1149
#define PID1OUT4                      1150
#define OUT5                          1151
#define PID1OUT5                      1152
#define OUT6                          1153
#define PID1OUT6                      1154
#define OUT7                          1155
#define PID1OUT7                      1156
#define PID1OUTLH                     1157
#define OUT8                          1158
#define PID1OUT8                      1159
#define OUT9                          1160
#define PID1OUT9                      1161
#define PID1OUT10                     1162
#define OUT10                         1163
#define PID1OUT11                     1164
#define OUT11                         1165
#define OUT12                         1166
#define PID1OUT12                     1167
#define OUT13                         1168
#define PID1OUT13                     1169
#define PID1OUT14                     1170
#define OUT14                         1171
#define PID1OUT15                     1172
#define OUT15                         1173
#define PID1OUTHL                     1174
#define PID1OUT16                     1175
#define OUT16                         1176
#define PID1OUT17                     1177
#define OUT17                         1178
#define OUT18                         1179
#define PID1OUT18                     1180
#define OUT19                         1181
#define PID1OUT19                     1182
#define OUT20                         1183
#define PID1OUT20                     1184
#define OUT21                         1185
#define PID1OUT21                     1186
#define OUT22                         1187
#define PID1OUT22                     1188
#define OUT23                         1189
#define PID1OUT23                     1190
#define PID1OUTHH                     1191
#define OUT24                         1192
#define PID1OUT24                     1193
#define OUT25                         1194
#define PID1OUT25                     1195
#define OUT26                         1196
#define PID1OUT26                     1197
#define OUT27                         1198
#define PID1OUT27                     1199
#define OUT28                         1200
#define PID1OUT28                     1201
#define OUT29                         1202
#define PID1OUT29                     1203
#define PID1OUT30                     1204
#define OUT30                         1205
#define OUT31                         1206
#define PID1OUT31                     1207
#define PID1OUTU                      1208
#define OUT32                         1209
#define PID1OUT32                     1210
#define OUT33                         1211
#define PID1OUT33                     1212
#define OUT34                         1213
#define PID1OUT34                     1214
#define OUT35                         1215
#define PID1OUT35                     1216
#define PID1Z1L                       1217
#define PID1Z10                       1218
#define Z10                           1219
#define PID1Z11                       1220
#define Z11                           1221
#define PID1Z12                       1222
#define Z12                           1223
#define PID1Z13                       1224
#define Z13                           1225
#define PID1Z14                       1226
#define Z14                           1227
#define PID1Z15                       1228
#define Z15                           1229
#define PID1Z16                       1230
#define Z16                           1231
#define PID1Z17                       1232
#define Z17                           1233
#define PID1Z1H                       1234
#define Z18                           1235
#define PID1Z18                       1236
#define Z19                           1237
#define PID1Z19                       1238
#define Z110                          1239
#define PID1Z110                      1240
#define Z111                          1241
#define PID1Z111                      1242
#define Z112                          1243
#define PID1Z112                      1244
#define Z113                          1245
#define PID1Z113                      1246
#define Z114                          1247
#define PID1Z114                      1248
#define Z115                          1249
#define PID1Z115                      1250
#define PID1Z1U                       1251
#define Z116                          1252
#define PID1Z116                      1253
#define PID1Z2L                       1254
#define Z20                           1255
#define PID1Z20                       1256
#define Z21                           1257
#define PID1Z21                       1258
#define Z22                           1259
#define PID1Z22                       1260
#define Z23                           1261
#define PID1Z23                       1262
#define Z24                           1263
#define PID1Z24                       1264
#define Z25                           1265
#define PID1Z25                       1266
#define Z26                           1267
#define PID1Z26                       1268
#define Z27                           1269
#define PID1Z27                       1270
#define PID1Z2H                       1271
#define Z28                           1272
#define PID1Z28                       1273
#define Z29                           1274
#define PID1Z29                       1275
#define PID1Z210                      1276
#define Z210                          1277
#define PID1Z211                      1278
#define Z211                          1279
#define PID1Z212                      1280
#define Z212                          1281
#define PID1Z213                      1282
#define Z213                          1283
#define PID1Z214                      1284
#define Z214                          1285
#define PID1Z215                      1286
#define Z215                          1287
#define PID1Z2U                       1288
#define PID1Z216                      1289
#define Z216                          1290
#define PID1ACCLL                     1291
#define PID1ACCLL_ACC0                1292
#define PID1ACC0                      1293
#define PID1ACCLL_ACC1                1294
#define PID1ACC1                      1295
#define PID1ACCLL_ACC2                1296
#define PID1ACC2                      1297
#define PID1ACCLL_ACC3                1298
#define PID1ACC3                      1299
#define PID1ACCLL_ACC4                1300
#define PID1ACC4                      1301
#define PID1ACCLL_ACC5                1302
#define PID1ACC5                      1303
#define PID1ACCLL_ACC6                1304
#define PID1ACC6                      1305
#define PID1ACCLL_ACC7                1306
#define PID1ACC7                      1307
#define PID1ACCLH                     1308
#define PID1ACCLH_ACC8                1309
#define PID1ACC8                      1310
#define PID1ACCLH_ACC9                1311
#define PID1ACC9                      1312
#define PID1ACC10                     1313
#define PID1ACCLH_ACC10               1314
#define PID1ACC11                     1315
#define PID1ACCLH_ACC11               1316
#define PID1ACC12                     1317
#define PID1ACCLH_ACC12               1318
#define PID1ACC13                     1319
#define PID1ACCLH_ACC13               1320
#define PID1ACC14                     1321
#define PID1ACCLH_ACC14               1322
#define PID1ACC15                     1323
#define PID1ACCLH_ACC15               1324
#define PID1ACCHL                     1325
#define PID1ACC16                     1326
#define ACC16                         1327
#define PID1ACC17                     1328
#define ACC17                         1329
#define PID1ACC18                     1330
#define ACC18                         1331
#define PID1ACC19                     1332
#define ACC19                         1333
#define ACC20                         1334
#define PID1ACC20                     1335
#define ACC21                         1336
#define PID1ACC21                     1337
#define ACC22                         1338
#define PID1ACC22                     1339
#define ACC23                         1340
#define PID1ACC23                     1341
#define PID1ACCHH                     1342
#define ACC24                         1343
#define PID1ACC24                     1344
#define ACC25                         1345
#define PID1ACC25                     1346
#define ACC26                         1347
#define PID1ACC26                     1348
#define ACC27                         1349
#define PID1ACC27                     1350
#define ACC28                         1351
#define PID1ACC28                     1352
#define ACC29                         1353
#define PID1ACC29                     1354
#define PID1ACC30                     1355
#define ACC30                         1356
#define ACC31                         1357
#define PID1ACC31                     1358
#define PID1ACCU                      1359
#define ACC32                         1360
#define PID1ACC32                     1361
#define ACC33                         1362
#define PID1ACC33                     1363
#define PID1ACC34                     1364
#define ACC34                         1365
#define PID1CON                       1366
#define PID1CON_MODE0                 1367
#define PID1MODE0                     1368
#define PID1CON_MODE                  1369
#define PID1MODE                      1370
#define PID1CON_MODE1                 1371
#define PID1MODE1                     1372
#define PID1CON_MODE2                 1373
#define PID1MODE2                     1374
#define PID1CON_BUSY                  1375
#define PID1BUSY                      1376
#define PID1EN                        1377
#define PID1CON_EN                    1378
#define PWM3DCL                       1379
#define PWM3DC0                       1380
#define PWM3DCL_PWMPW0                1381
#define PWM3DCL_DC0                   1382
#define PWM3DCL_DC                    1383
#define PWM3DC1                       1384
#define PWM3DCL_PWMPW1                1385
#define PWM3DCL_DC1                   1386
#define PWM3DCH                       1387
#define PWM3DC2                       1388
#define PWM3DCH_DC2                   1389
#define PWM3DCH_DC                    1390
#define PWM3DCH_PWMPW2                1391
#define PWM3DC3                       1392
#define PWM3DCH_DC3                   1393
#define PWM3DCH_PWMPW3                1394
#define PWM3DC4                       1395
#define PWM3DCH_DC4                   1396
#define PWM3DCH_PWMPW4                1397
#define PWM3DC5                       1398
#define PWM3DCH_DC5                   1399
#define PWM3DCH_PWMPW5                1400
#define PWM3DC6                       1401
#define PWM3DCH_DC6                   1402
#define PWM3DCH_PWMPW6                1403
#define PWM3DC7                       1404
#define PWM3DCH_DC7                   1405
#define PWM3DCH_PWMPW7                1406
#define PWM3DC8                       1407
#define PWM3DCH_DC8                   1408
#define PWM3DCH_PWMPW8                1409
#define PWM3DC9                       1410
#define PWM3DCH_DC9                   1411
#define PWM3DCH_PWMPW9                1412
#define PWM3CON                       1413
#define PWM3CON_POL                   1414
#define PWM3POL                       1415
#define PWM3CON_OUT                   1416
#define PWM3OUT                       1417
#define PWM3EN                        1418
#define PWM3CON_EN                    1419
#define PWM4DCL                       1420
#define PWM4DCL_PWMPW0                1421
#define PWM4DCL_DC                    1422
#define PWM4DC0                       1423
#define PWM4DCL_DC0                   1424
#define PWM4DCL_PWMPW1                1425
#define PWM4DC1                       1426
#define PWM4DCL_DC1                   1427
#define PWM4DCH                       1428
#define PWM4DCH_PWMPW2                1429
#define PWM4DCH_DC                    1430
#define PWM4DC2                       1431
#define PWM4DCH_DC2                   1432
#define PWM4DCH_PWMPW3                1433
#define PWM4DC3                       1434
#define PWM4DCH_DC3                   1435
#define PWM4DCH_PWMPW4                1436
#define PWM4DC4                       1437
#define PWM4DCH_DC4                   1438
#define PWM4DCH_PWMPW5                1439
#define PWM4DC5                       1440
#define PWM4DCH_DC5                   1441
#define PWM4DCH_PWMPW6                1442
#define PWM4DC6                       1443
#define PWM4DCH_DC6                   1444
#define PWM4DCH_PWMPW7                1445
#define PWM4DC7                       1446
#define PWM4DCH_DC7                   1447
#define PWM4DCH_PWMPW8                1448
#define PWM4DC8                       1449
#define PWM4DCH_DC8                   1450
#define PWM4DCH_PWMPW9                1451
#define PWM4DC9                       1452
#define PWM4DCH_DC9                   1453
#define PWM4CON                       1454
#define PWM4POL                       1455
#define PWM4CON_POL                   1456
#define PWM4CON_OUT                   1457
#define PWM4OUT                       1458
#define PWM4EN                        1459
#define PWM4CON_EN                    1460
#define CWG1DBR0                      1461
#define CWG1DBR                       1462
#define DBR                           1463
#define DBR0                          1464
#define CWG1DBR1                      1465
#define DBR1                          1466
#define CWG1DBR2                      1467
#define DBR2                          1468
#define CWG1DBR3                      1469
#define DBR3                          1470
#define CWG1DBR4                      1471
#define DBR4                          1472
#define CWG1DBR5                      1473
#define DBR5                          1474
#define CWG1DBF                       1475
#define CWG1DBF0                      1476
#define DBF                           1477
#define DBF0                          1478
#define CWG1DBF1                      1479
#define DBF1                          1480
#define CWG1DBF2                      1481
#define DBF2                          1482
#define CWG1DBF3                      1483
#define DBF3                          1484
#define CWG1DBF4                      1485
#define DBF4                          1486
#define DBF5                          1487
#define CWG1DBF5                      1488
#define CWG1AS0                       1489
#define CWG1LSAC                      1490
#define LSAC                          1491
#define LSAC0                         1492
#define CWG1LSAC0                     1493
#define LSAC1                         1494
#define CWG1LSAC1                     1495
#define LSBD0                         1496
#define CWG1LSBD0                     1497
#define LSBD                          1498
#define CWG1LSBD                      1499
#define LSBD1                         1500
#define CWG1LSBD1                     1501
#define CWG1REN                       1502
#define REN                           1503
#define CWG1SHUTDOWN                  1504
#define SHUTDOWN                      1505
#define CWG1AS1                       1506
#define INAS                          1507
#define CWG1INAS                      1508
#define C1AS                          1509
#define CWG1C1AS                      1510
#define C2AS                          1511
#define CWG1C2AS                      1512
#define TMR2AS                        1513
#define CWG1TMR2AS                    1514
#define CWG1TMR4AS                    1515
#define TMR4AS                        1516
#define CWG1TMR6AS                    1517
#define TMR6AS                        1518
#define CWG1OCON0                     1519
#define CWG1STRA                      1520
#define STRA                          1521
#define STRB                          1522
#define CWG1STRB                      1523
#define CWG1STRC                      1524
#define STRC                          1525
#define CWG1STRD                      1526
#define STRD                          1527
#define OVRA                          1528
#define CWG1OVRA                      1529
#define CWG1OVRB                      1530
#define OVRB                          1531
#define OVRC                          1532
#define CWG1OVRC                      1533
#define OVRD                          1534
#define CWG1OVRD                      1535
#define CWG1CON0                      1536
#define CWG1MODE0                     1537
#define CWG1CON0_MODE0                1538
#define CWG1MODE                      1539
#define CWG1CON0_MODE                 1540
#define CWG1MODE1                     1541
#define CWG1CON0_MODE1                1542
#define CWG1MODE2                     1543
#define CWG1CON0_MODE2                1544
#define LD                            1545
#define CWG1LD                        1546
#define CWG1CON0_EN                   1547
#define CWG1EN                        1548
#define G1EN                          1549
#define CWG1CON1                      1550
#define CWG1POLA                      1551
#define POLA                          1552
#define CWG1POLB                      1553
#define POLB                          1554
#define CWG1POLC                      1555
#define POLC                          1556
#define CWG1POLD                      1557
#define POLD                          1558
#define IN                            1559
#define CWG1IN                        1560
#define CWG1CLKCON                    1561
#define CWG1CLKCON_CS                 1562
#define CWG1CS                        1563
#define CWG1ISM                       1564
#define CWG1IS                        1565
#define IS                            1566
#define IS0                           1567
#define CWG1IS0                       1568
#define CWG1IS1                       1569
#define IS1                           1570
#define IS2                           1571
#define CWG1IS2                       1572
#define IS3                           1573
#define CWG1IS3                       1574
#define WDTCON0                       1575
#define WDTCON0_SEN                   1576
#define SWDTEN                        1577
#define WDTSEN                        1578
#define WDTPS                         1579
#define WDTPS0                        1580
#define WDTPS1                        1581
#define WDTPS2                        1582
#define WDTPS3                        1583
#define WDTPS4                        1584
#define WDTCON1                       1585
#define WDTWINDOW0                    1586
#define WINDOW0                       1587
#define WINDOW                        1588
#define WDTWINDOW                     1589
#define WDTWINDOW1                    1590
#define WINDOW1                       1591
#define WDTWINDOW2                    1592
#define WINDOW2                       1593
#define WDTCS                         1594
#define WDTCS0                        1595
#define WDTCS1                        1596
#define WDTCS2                        1597
#define WDTPSL                        1598
#define WDTPSL_WDTPSCNT               1599
#define WDTPSL_PSCNT                  1600
#define WDTPSCNT0                     1601
#define PSCNT0                        1602
#define WDTPSCNT1                     1603
#define PSCNT1                        1604
#define WDTPSCNT2                     1605
#define PSCNT2                        1606
#define WDTPSCNT3                     1607
#define PSCNT3                        1608
#define WDTPSCNT4                     1609
#define PSCNT4                        1610
#define WDTPSCNT5                     1611
#define PSCNT5                        1612
#define WDTPSCNT6                     1613
#define PSCNT6                        1614
#define WDTPSCNT7                     1615
#define PSCNT7                        1616
#define WDTPSH                        1617
#define PSCNT8                        1618
#define WDTPSH_WDTPSCNT               1619
#define WDTPSH_PSCNT                  1620
#define WDTPSCNT8                     1621
#define PSCNT9                        1622
#define WDTPSCNT9                     1623
#define PSCNT10                       1624
#define WDTPSCNT10                    1625
#define PSCNT11                       1626
#define WDTPSCNT11                    1627
#define PSCNT12                       1628
#define WDTPSCNT12                    1629
#define PSCNT13                       1630
#define WDTPSCNT13                    1631
#define PSCNT14                       1632
#define WDTPSCNT14                    1633
#define PSCNT15                       1634
#define WDTPSCNT15                    1635
#define PSCNT16                       1636
#define WDTPSCNT16                    1637
#define WDTPSCNT17                    1638
#define PSCNT17                       1639
#define STATE                         1640
#define WDTSTATE                      1641
#define WDTTMR                        1642
#define WDTTMR0                       1643
#define WDTTMR1                       1644
#define WDTTMR2                       1645
#define WDTTMR3                       1646
#define WDTTMR4                       1647
#define SCANLADRL                     1648
