tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1619_tdd.h
#define SCANLADRL_LADR                1649
#define LDAR0                         1650
#define SCANLADRL_SCANLADR            1651
#define SCANLADR0                     1652
#define SCANLADR1                     1653
#define LDAR1                         1654
#define LADR2                         1655
#define SCANLADR2                     1656
#define LADR3                         1657
#define SCANLADR3                     1658
#define LADR4                         1659
#define SCANLADR4                     1660
#define LADR5                         1661
#define SCANLADR5                     1662
#define SCANLADR6                     1663
#define LADR6                         1664
#define LADR7                         1665
#define SCANLADR7                     1666
#define SCANLADRH                     1667
#define LADR8                         1668
#define SCANLADRH_SCANLADR            1669
#define SCANLADR8                     1670
#define SCANLADRH_LADR                1671
#define LADR9                         1672
#define SCANLADR9                     1673
#define LADR10                        1674
#define SCANLADR10                    1675
#define SCANLADR11                    1676
#define LADR11                        1677
#define LADR12                        1678
#define SCANLADR12                    1679
#define LADR13                        1680
#define SCANLADR13                    1681
#define LADR14                        1682
#define SCANLADR14                    1683
#define LADR15                        1684
#define SCANLADR15                    1685
#define SCANHADRL                     1686
#define SCANHADR0                     1687
#define HADR0                         1688
#define SCANHADRL_HADR                1689
#define SCANHADRL_SCANHADR            1690
#define SCANHADR1                     1691
#define HADR1                         1692
#define SCANHADR2                     1693
#define HARD2                         1694
#define SCANHADR3                     1695
#define HADR3                         1696
#define SCANHADR4                     1697
#define HADR4                         1698
#define SCANHADR5                     1699
#define HADR5                         1700
#define SCANHADR6                     1701
#define HADR6                         1702
#define SCANHADR7                     1703
#define HADR7                         1704
#define SCANHADRH                     1705
#define HADR8                         1706
#define SCANHADRH_SCANHADR            1707
#define SCANHADR8                     1708
#define SCANHADRH_HADR                1709
#define HADR9                         1710
#define SCANHADR9                     1711
#define HADR10                        1712
#define SCANHADR10                    1713
#define SCANHADR11                    1714
#define HADR11                        1715
#define HADR12                        1716
#define SCANHADR12                    1717
#define HADR13                        1718
#define SCANHADR13                    1719
#define HADR14                        1720
#define SCANHADR14                    1721
#define HADR15                        1722
#define SCANHADR15                    1723
#define SCANCON0                      1724
#define SCANMODE                      1725
#define SCANMODE0                     1726
#define SCANCON0_MODE0                1727
#define SCANCON0_MODE                 1728
#define SCANCON0_MODE1                1729
#define SCANMODE1                     1730
#define INTM                          1731
#define SCANINTM                      1732
#define INVALID                       1733
#define SCANINVALID                   1734
#define SCANCON0_BUSY                 1735
#define SCANBUSY                      1736
#define SCANGO                        1737
#define SCANEN                        1738
#define SCANCON0_EN                   1739
#define SCANTRIG                      1740
#define TSEL0                         1741
#define TSEL                          1742
#define SCANTSEL0                     1743
#define SCANTSEL                      1744
#define TSEL1                         1745
#define SCANTSEL1                     1746
#define TSEL2                         1747
#define SCANTSEL2                     1748
#define TSEL3                         1749
#define SCANTSEL3                     1750
#define CRCDATL                       1751
#define CRCDATL_DAT                   1752
#define CRCDAT0                       1753
#define DAT0                          1754
#define CRCDATL_CRCDAT                1755
#define CRCDAT1                       1756
#define DAT1                          1757
#define CRCDAT2                       1758
#define DAT2                          1759
#define CRCDAT3                       1760
#define DAT3                          1761
#define CRCDAT4                       1762
#define DAT4                          1763
#define CRCDAT5                       1764
#define DAT5                          1765
#define CRCDAT6                       1766
#define DAT6                          1767
#define DAT7                          1768
#define CRDCDAT7                      1769
#define CRCDATH                       1770
#define CRCDAT8                       1771
#define DAT8                          1772
#define CRCDATH_CRCDAT                1773
#define CRCDATH_DAT                   1774
#define CRCDAT9                       1775
#define DAT9                          1776
#define DAT10                         1777
#define CRCDAT10                      1778
#define DAT11                         1779
#define CRCDAT11                      1780
#define DAT12                         1781
#define CRCDAT12                      1782
#define DAT13                         1783
#define CRCDAT13                      1784
#define DAT14                         1785
#define CRCDAT14                      1786
#define DAT15                         1787
#define CRCDAT15                      1788
#define CRCACCL                       1789
#define CRCACCL_CRCACC                1790
#define CRCACC0                       1791
#define CRCACCL_ACC0                  1792
#define CRCACCL_ACC                   1793
#define CRCACC1                       1794
#define CRCACCL_ACC1                  1795
#define CRCACC2                       1796
#define CRCACCL_ACC2                  1797
#define CRCACC3                       1798
#define CRCACCL_ACC3                  1799
#define CRCACC4                       1800
#define CRCACCL_ACC4                  1801
#define CRCACC5                       1802
#define CRCACCL_ACC5                  1803
#define CRCACC6                       1804
#define CRCACCL_ACC6                  1805
#define CRCACC7                       1806
#define CRCACCL_ACC7                  1807
#define CRCACCH                       1808
#define CRCACCH_ACC                   1809
#define CRCACCH_CRCACC                1810
#define CRCACC8                       1811
#define CRCACCH_ACC8                  1812
#define CRCACC9                       1813
#define CRCACCH_ACC9                  1814
#define CRCACCH_ACC10                 1815
#define CRCACC10                      1816
#define CRCACCH_ACC11                 1817
#define CRCACC11                      1818
#define CRCACCH_ACC12                 1819
#define CRCACC12                      1820
#define CRCACCH_ACC13                 1821
#define CRCACC13                      1822
#define CRCACCH_ACC14                 1823
#define CRCACC14                      1824
#define CRCACCH_ACC15                 1825
#define CRCACC15                      1826
#define CRCSHIFTL                     1827
#define CRCSHIFTL_CRCSHIFT            1828
#define CRCSHIFTL_SHIFT               1829
#define SHIFT0                        1830
#define CRCSHIFT0                     1831
#define SHIFT1                        1832
#define CRCSHIFT1                     1833
#define SHIFT2                        1834
#define CRCSHIFT2                     1835
#define SHIFT3                        1836
#define CRCSHIFT3                     1837
#define SHIFT4                        1838
#define CRCSHIFT4                     1839
#define SHIFT5                        1840
#define CRCSHIFT5                     1841
#define SHIFT6                        1842
#define CRCSHIFT6                     1843
#define SHIFT7                        1844
#define CRCSHIFT7                     1845
#define CRCSHIFTH                     1846
#define CRCSHIFT8                     1847
#define CRCSHIFTH_SHIFT               1848
#define CRCSHIFTH_CRCSHIFT            1849
#define SHIFT8                        1850
#define CRCSHIFT9                     1851
#define SHIFT9                        1852
#define SHIFT10                       1853
#define CRCSHIFT10                    1854
#define SHIFT11                       1855
#define CRCSHIFT11                    1856
#define SHIFT12                       1857
#define CRCSHIFT12                    1858
#define SHIFT13                       1859
#define CRCSHIFT13                    1860
#define CRCSHIFT14                    1861
#define SHIFT14                       1862
#define SHIFT15                       1863
#define CRCSHIFT15                    1864
#define CRCXORL                       1865
#define XOR1                          1866
#define CRCXOR1                       1867
#define XOR2                          1868
#define CRCXOR2                       1869
#define XOR3                          1870
#define CRCXOR3                       1871
#define XOR4                          1872
#define CRCXOR4                       1873
#define XOR5                          1874
#define CRCXOR5                       1875
#define XOR6                          1876
#define CRCXOR6                       1877
#define XOR7                          1878
#define CRCXOR7                       1879
#define CRCXORH                       1880
#define XOR8                          1881
#define CRCXOR8                       1882
#define XOR9                          1883
#define CRCXOR9                       1884
#define CRCXOR10                      1885
#define XOR10                         1886
#define CRCXOR11                      1887
#define XOR11                         1888
#define XOR12                         1889
#define CRCXOR12                      1890
#define XOR13                         1891
#define CRCXOR13                      1892
#define CRCXOR14                      1893
#define XOR14                         1894
#define CRCXOR15                      1895
#define XOR15                         1896
#define CRCCON0                       1897
#define CRCFULL                       1898
#define FULL                          1899
#define CRCSHIFTM                     1900
#define SHIFTM                        1901
#define ACCM                          1902
#define CRCACCM                       1903
#define CRCCON0_BUSY                  1904
#define CRCBUSY                       1905
#define CRCGO                         1906
#define CRCCON0_EN                    1907
#define CRCEN                         1908
#define CRCCON1                       1909
#define PLEN0                         1910
#define CRCPLEN0                      1911
#define PLEN                          1912
#define CRCPLEN                       1913
#define PLEN1                         1914
#define CRCPLEN1                      1915
#define PLEN2                         1916
#define CRCPLEN2                      1917
#define PLEN3                         1918
#define CRCPLEN3                      1919
#define DLEN                          1920
#define CRCDLEN                       1921
#define CRCDLEN0                      1922
#define DLEN0                         1923
#define DLEN1                         1924
#define CRCDLEN1                      1925
#define CRCDLEN2                      1926
#define DLEN2                         1927
#define DLEN3                         1928
#define CRCDLEN3                      1929
#define AT1RESL                       1930
#define AT1RES0                       1931
#define RES0                          1932
#define RES1                          1933
#define AT1RES1                       1934
#define AT1RES2                       1935
#define RES2                          1936
#define AT1RES3                       1937
#define RES3                          1938
#define AT1RES4                       1939
#define RES4                          1940
#define AT1RES5                       1941
#define RES5                          1942
#define RES6                          1943
#define AT1RES6                       1944
#define AT1RES7                       1945
#define RES7                          1946
#define AT1RESH                       1947
#define RES8                          1948
#define AT1RES8                       1949
#define RES9                          1950
#define AT1RES9                       1951
#define AT1MISSL                      1952
#define AT1MISS0                      1953
#define MISS0                         1954
#define AT1MISS1                      1955
#define MISS1                         1956
#define AT1MISS2                      1957
#define MISS2                         1958
#define AT1MISS3                      1959
#define MISS3                         1960
#define AT1MISS4                      1961
#define MISS4                         1962
#define AT1MISS5                      1963
#define MISS5                         1964
#define AT1MISS6                      1965
#define MISS6                         1966
#define AT1MISS7                      1967
#define MISS7                         1968
#define AT1MISSH                      1969
#define MISS8                         1970
#define AT1MISS8                      1971
#define MISS9                         1972
#define AT1MISS9                      1973
#define MISS10                        1974
#define AT1MISS10                     1975
#define MISS11                        1976
#define AT1MISS11                     1977
#define AT1MISS12                     1978
#define MISS12                        1979
#define AT1MISS13                     1980
#define MISS13                        1981
#define AT1MISS14                     1982
#define MISS14                        1983
#define AT1MISS15                     1984
#define MISS15                        1985
#define AT1PERL                       1986
#define PER0                          1987
#define AT1PER0                       1988
#define PERL0                         1989
#define PER1                          1990
#define AT1PER1                       1991
#define PERL1                         1992
#define PER2                          1993
#define AT1PER2                       1994
#define PERL2                         1995
#define PER3                          1996
#define AT1PER3                       1997
#define PERL3                         1998
#define PER4                          1999
#define AT1PER4                       2000
#define PERL4                         2001
#define PER5                          2002
#define AT1PER5                       2003
#define PERL5                         2004
#define PER6                          2005
#define AT1PER6                       2006
#define PERL6                         2007
#define PER7                          2008
#define AT1PER7                       2009
#define PERL7                         2010
#define AT1PERH                       2011
#define PER8                          2012
#define AT1PER8                       2013
#define PERH0                         2014
#define PER9                          2015
#define AT1PER9                       2016
#define PERH1                         2017
#define AT1PER10                      2018
#define PER10                         2019
#define PERH2                         2020
#define AT1PER11                      2021
#define PER11                         2022
#define PERH3                         2023
#define AT1PER12                      2024
#define PER12                         2025
#define PERH4                         2026
#define AT1PER13                      2027
#define PER13                         2028
#define PERH5                         2029
#define AT1PER14                      2030
#define PER14                         2031
#define PERH6                         2032
#define PER15                         2033
#define AT1POV                        2034
#define PERH7                         2035
#define AT1PHSL                       2036
#define PHS0                          2037
#define AT1PHS0                       2038
#define PHS1                          2039
#define AT1PHS1                       2040
#define PHS2                          2041
#define AT1PHS2                       2042
#define PHS3                          2043
#define AT1PHS3                       2044
#define PHS4                          2045
#define AT1PHS4                       2046
#define PHS5                          2047
#define AT1PHS5                       2048
#define PHS6                          2049
#define AT1PHS6                       2050
#define PHS7                          2051
#define AT1PHS7                       2052
#define AT1PHSH                       2053
#define PHSL8                         2054
#define PHS8                          2055
#define AT1PHS8                       2056
#define PHSL9                         2057
#define PHS9                          2058
#define AT1PHS9                       2059
#define AT1CON0                       2060
#define AT1CON0_MODE                  2061
#define AT1MODE                       2062
#define APMOD                         2063
#define AT1APMOD                      2064
#define AT1CON0_POL                   2065
#define AT1POL                        2066
#define AT1PS0                        2067
#define AT1CON0_PS                    2068
#define AT1PS                         2069
#define AT1CON0_PS0                   2070
#define AT1PS1                        2071
#define AT1CON0_PS1                   2072
#define PREC                          2073
#define AT1PREC                       2074
#define AT1CON0_EN                    2075
#define AT1EN                         2076
#define AT1CON1                       2077
#define AT1VALID                      2078
#define VALID                         2079
#define AT1ACCS                       2080
#define ACCS                          2081
#define MPP                           2082
#define AT1MPP                        2083
#define AT1PRP                        2084
#define PRP                           2085
#define AT1PHP                        2086
#define PHP                           2087
#define AT1IR0                        2088
#define AT1PERIF                      2089
#define AT1MISSIF                     2090
#define AT1PHSIF                      2091
#define AT1IE0                        2092
#define AT1PERIE                      2093
#define AT1MISSIE                     2094
#define AT1PHSIE                      2095
#define AT1IR1                        2096
#define AT1CC1IF                      2097
#define AT1CC2IF                      2098
#define AT1CC3IF                      2099
#define AT1IE1                        2100
#define AT1CC1IE                      2101
#define AT1CC2IE                      2102
#define AT1CC3IE                      2103
#define AT1STPTL                      2104
#define STPT0                         2105
#define AT1STPT0                      2106
#define STPT1                         2107
#define AT1STPT1                      2108
#define STPT2                         2109
#define AT1STPT2                      2110
#define STPT3                         2111
#define AT1STPT3                      2112
#define STPT4                         2113
#define AT1STPT4                      2114
#define STPT5                         2115
#define AT1STPT5                      2116
#define STPT6                         2117
#define AT1STPT6                      2118
#define STPT7                         2119
#define AT1STPT7                      2120
#define AT1STPTH                      2121
#define STPT8                         2122
#define AT1STPT8                      2123
#define STPT9                         2124
#define AT1STPT9                      2125
#define AT1STPT10                     2126
#define STPT10                        2127
#define AT1STPT11                     2128
#define STPT11                        2129
#define AT1STPT12                     2130
#define STPT12                        2131
#define AT1STPT13                     2132
#define STPT13                        2133
#define AT1STPT14                     2134
#define STPT14                        2135
#define AT1ERRL                       2136
#define AT1ERR0                       2137
#define ERR0                          2138
#define ERRL0                         2139
#define AT1ERR1                       2140
#define ERR1                          2141
#define ERRL1                         2142
#define AT1ERR2                       2143
#define ERR2                          2144
#define ERRL2                         2145
#define AT1ERR3                       2146
#define ERR3                          2147
#define ERRL3                         2148
#define AT1ERR4                       2149
#define ERRL4                         2150
#define ERR4                          2151
#define AT1ERR5                       2152
#define ERRL5                         2153
#define ERR5                          2154
#define AT1ERR6                       2155
#define ERRL6                         2156
#define ERR6                          2157
#define AT1ERR7                       2158
#define ERRL7                         2159
#define ERR7                          2160
#define AT1ERRH                       2161
#define AT1ERR8                       2162
#define ERRH0                         2163
#define ERR8                          2164
#define AT1ERR9                       2165
#define ERRH1                         2166
#define ERR9                          2167
#define AT1ERR10                      2168
#define ERR10                         2169
#define ERRH2                         2170
#define AT1ERR11                      2171
#define ERR11                         2172
#define ERRH3                         2173
#define AT1ERR12                      2174
#define ERR12                         2175
#define ERRH4                         2176
#define AT1ERR13                      2177
#define ERR13                         2178
#define ERRH5                         2179
#define AT1ERR14                      2180
#define ERR14                         2181
#define ERRH6                         2182
#define AT1ERR15                      2183
#define ERR15                         2184
#define ERRH7                         2185
#define AT1CLK                        2186
#define AT1CLK_CS                     2187
#define AT1CS                         2188
#define AT1CLK_CS0                    2189
#define AT1CS0                        2190
#define AT1SIG                        2191
#define AT1SSEL0                      2192
#define AT1SIG_SSEL0                  2193
#define AT1SIG_SSEL                   2194
#define AT1SSEL                       2195
#define AT1SSEL1                      2196
#define AT1SIG_SSEL1                  2197
#define AT1SSEL2                      2198
#define AT1SIG_SSEL2                  2199
#define AT1CSEL1                      2200
#define CP1S0                         2201
#define AT1CP1S0                      2202
#define AT1CP1S                       2203
#define CP1S                          2204
#define CP1S1                         2205
#define AT1CP1S1                      2206
