tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1619_tdd.h
#define CP1S2                         2207
#define AT1CP1S2                      2208
#define AT1CC1L                       2209
#define AT1CC10                       2210
#define CC10                          2211
#define AT1CC11                       2212
#define CC11                          2213
#define AT1CC12                       2214
#define CC12                          2215
#define AT1CC1L_CC13                  2216
#define AT1CC13                       2217
#define AT1CC14                       2218
#define CC14                          2219
#define AT1CC15                       2220
#define CC15                          2221
#define AT1CC16                       2222
#define CC16                          2223
#define AT1CC17                       2224
#define CC17                          2225
#define AT1CC1H                       2226
#define CC18                          2227
#define AT1CC18                       2228
#define CC19                          2229
#define AT1CC19                       2230
#define AT1CCON1                      2231
#define AT1CC1MODE                    2232
#define CC1MODE                       2233
#define CAP1P                         2234
#define AT1CAP1P                      2235
#define CC1POL                        2236
#define AT1CC1POL                     2237
#define AT1CC1EN                      2238
#define CC1EN                         2239
#define AT1CSEL2                      2240
#define AT1CP2S0                      2241
#define AT1CP2S                       2242
#define CP2S0                         2243
#define CP2S                          2244
#define CP2S1                         2245
#define AT1CP2S1                      2246
#define AT1CP2S2                      2247
#define CP2S2                         2248
#define AT1CC2L                       2249
#define AT1CC20                       2250
#define CC20                          2251
#define AT1CC21                       2252
#define CC21                          2253
#define AT1CC22                       2254
#define CC22                          2255
#define AT1CC23                       2256
#define AT1CC2L_CC13                  2257
#define AT1CC24                       2258
#define CC24                          2259
#define AT1CC25                       2260
#define CCW5                          2261
#define AT1CC26                       2262
#define CC26                          2263
#define AT1CC27                       2264
#define CC27                          2265
#define AT1CC2H                       2266
#define CC28                          2267
#define AT1CC28                       2268
#define CC29                          2269
#define AT1CC29                       2270
#define AT1CCON2                      2271
#define CC2MODE                       2272
#define AT1CC2MODE                    2273
#define AT1CAP2P                      2274
#define CAP2P                         2275
#define AT1CC2POL                     2276
#define CC2POL                        2277
#define CC2EN                         2278
#define AT1CC2EN                      2279
#define AT1CSEL3                      2280
#define CP3S0                         2281
#define AT1CP3S                       2282
#define AT1CP3S0                      2283
#define CP3S                          2284
#define CP3S1                         2285
#define AT1CP3S1                      2286
#define CP3S2                         2287
#define AT1CP3S2                      2288
#define AT1CC3L                       2289
#define AT1CC30                       2290
#define CC30                          2291
#define AT1CC31                       2292
#define CC31                          2293
#define AT1CC32                       2294
#define CC32                          2295
#define AT1CC33                       2296
#define CC33                          2297
#define AT1CC34                       2298
#define CC34                          2299
#define AT1CC35                       2300
#define CC35                          2301
#define AT1CC36                       2302
#define CC36                          2303
#define AT1CC37                       2304
#define CC37                          2305
#define AT1CC3H                       2306
#define CC38                          2307
#define AT1CC38                       2308
#define CC39                          2309
#define AT1CC39                       2310
#define AT1CCON3                      2311
#define AT1CC3MODE                    2312
#define CC3MODE                       2313
#define AT1CAP3P                      2314
#define CAP3P                         2315
#define AT1CC3POL                     2316
#define CC3POL                        2317
#define CC3EN                         2318
#define AT1CC3EN                      2319
#define SMT1TMRL                      2320
#define SMT1TMR0                      2321
#define SMT1TMRL_SMT1TMR              2322
#define SMT1TMR1                      2323
#define SMT1TMR2                      2324
#define SMT1TMR3                      2325
#define SMT1TMR4                      2326
#define SMT1TMR5                      2327
#define SMT1TMR6                      2328
#define SMT1TMR7                      2329
#define SMT1TMRH                      2330
#define SMT1TMR8                      2331
#define SMT1TMRH_SMT1TMR              2332
#define SMT1TMR9                      2333
#define SMT1TMR10                     2334
#define SMT1TMR11                     2335
#define SMT1TMR12                     2336
#define SMT1TMR13                     2337
#define SMT1TMR14                     2338
#define SMT1TMR15                     2339
#define SMT1TMRU                      2340
#define SMT1TMR16                     2341
#define SMT1TMRU_SMT1TMR              2342
#define SMT1TMR17                     2343
#define SMT1TMR18                     2344
#define SMT1TMR19                     2345
#define SMT1TMR20                     2346
#define SMT1TMR21                     2347
#define SMT1TMR22                     2348
#define SMT1TMR23                     2349
#define SMT1CPRL                      2350
#define SMT1CPRL_SMT1CPR              2351
#define SMT1CPR0                      2352
#define SMT1CPR1                      2353
#define SMT1CPR2                      2354
#define SMT1CPR3                      2355
#define SMT1CPR4                      2356
#define SMT1CPR5                      2357
#define SMT1CPR6                      2358
#define SMT1CPR7                      2359
#define SMT1CPRH                      2360
#define SMT1CPRH_SMT1CPR              2361
#define SMT1CPR8                      2362
#define SMT1CPR9                      2363
#define SMT1CPR10                     2364
#define SMT1CPR11                     2365
#define SMT1CPR12                     2366
#define SMT1CPR13                     2367
#define SMT1CPR14                     2368
#define SMT1CPR15                     2369
#define SMT1CPRU                      2370
#define SMT1CPR16                     2371
#define SMT1CPRU_SMT1CPR              2372
#define SMT1CPR17                     2373
#define SMT1CPR18                     2374
#define SMT1CPR19                     2375
#define SMT1CPR20                     2376
#define SMT1CPR21                     2377
#define SMT1CPR22                     2378
#define SMT1CPR23                     2379
#define SMT1CPWL                      2380
#define SMT1CPW0                      2381
#define SMT1CPWL_SMT1CPW              2382
#define SMT1CPW1                      2383
#define SMT1CPW2                      2384
#define SMT1CPW3                      2385
#define SMT1CPW4                      2386
#define SMT1CPW5                      2387
#define SMT1CPW6                      2388
#define SMT1CPW7                      2389
#define SMT1CPWH                      2390
#define SMT1CPW8                      2391
#define SMT1CPWH_SMT1CPW              2392
#define SMT1CPW9                      2393
#define SMT1CPW10                     2394
#define SMT1CPW11                     2395
#define SMT1CPW12                     2396
#define SMT1CPW13                     2397
#define SMT1CPW14                     2398
#define SMT1CPW15                     2399
#define SMT1CPWU                      2400
#define SMT1CPWU_SMT1CPW              2401
#define SMT1CPW16                     2402
#define SMT1CPW17                     2403
#define SMT1CPW18                     2404
#define SMT1CPW19                     2405
#define SMT1CPW20                     2406
#define SMT1CPW21                     2407
#define SMT1CPW22                     2408
#define SMT1CPW23                     2409
#define SMT1PRL                       2410
#define SMT1PR0                       2411
#define SMT1PRL_SMT1PR                2412
#define SMT1PR1                       2413
#define SMT1PR2                       2414
#define SMT1PR3                       2415
#define SMT1PR4                       2416
#define SMT1PR5                       2417
#define SMT1PR6                       2418
#define SMT1PR7                       2419
#define SMT1PRH                       2420
#define SMT1PR8                       2421
#define SMT1PRH_SMT1PR                2422
#define SMT1PR9                       2423
#define SMT1PR10                      2424
#define SMT1PR11                      2425
#define SMT1PR12                      2426
#define SMT1PR13                      2427
#define SMT1PR14                      2428
#define SMT1PR15                      2429
#define SMT1PRU                       2430
#define SMT1PR16                      2431
#define SMT1PRU_SMT1PR                2432
#define SMT1PR17                      2433
#define SMT1PR18                      2434
#define SMT1PR19                      2435
#define SMT1PR20                      2436
#define SMT1PR21                      2437
#define SMT1PR22                      2438
#define SMT1PR23                      2439
#define SMT1CON0                      2440
#define SMT1PS0                       2441
#define SMT1PS                        2442
#define SMT1PS1                       2443
#define SMT1CON0_CPOL                 2444
#define SMT1CON0_SPOL                 2445
#define SMT1CON0_WPOL                 2446
#define SMT1CON0_STP                  2447
#define SMT1CON0_EN                   2448
#define SMT1CON1                      2449
#define SMT1MODE0                     2450
#define SMT1CON1_MODE                 2451
#define SMT1CON1_MODE0                2452
#define SMT1MODE                      2453
#define SMT1CON1_MODE1                2454
#define SMT1MODE1                     2455
#define SMT1CON1_MODE2                2456
#define SMT1MODE2                     2457
#define SMT1CON1_MODE3                2458
#define SMT1MODE3                     2459
#define SMT1CON1_REPEAT               2460
#define SMT1REPEAT                    2461
#define SMT1GO                        2462
#define SMT1STAT                      2463
#define SMT1STAT_AS                   2464
#define SMT1AS                        2465
#define SMT1STAT_WS                   2466
#define SMT1WS                        2467
#define SMT1STAT_TS                   2468
#define SMT1TS                        2469
#define SMT1RESET                     2470
#define SMT1STAT_RST                  2471
#define SMT1CPWUP                     2472
#define SMT1STAT_CPWUP                2473
#define SMT1CPRUP                     2474
#define SMT1STAT_CPRUP                2475
#define SMT1CLK                       2476
#define SMT1CLK_CSEL0                 2477
#define SMT1CSEL0                     2478
#define SMT1CSEL                      2479
#define SMT1CLK_CSEL                  2480
#define SMT1CSEL1                     2481
#define SMT1CLK_CSEL1                 2482
#define SMT1CSEL2                     2483
#define SMT1CLK_CSEL2                 2484
#define SMT1SIG                       2485
#define SMT1SSEL                      2486
#define SMT1SIG_SSEL0                 2487
#define SMT1SIG_SSEL                  2488
#define SMT1SSEL0                     2489
#define SMT1SIG_SSEL1                 2490
#define SMT1SSEL1                     2491
#define SMT1SIG_SSEL2                 2492
#define SMT1SSEL2                     2493
#define SMT1SIG_SSEL3                 2494
#define SMT1SSEL3                     2495
#define SMT1SIG_SSEL4                 2496
#define SMT1SSEL4                     2497
#define SMT1WIN                       2498
#define SMT1WSEL                      2499
#define SMT1WSEL0                     2500
#define SMT1WIN_WSEL0                 2501
#define SMT1WIN_WSEL                  2502
#define SMT1WSEL1                     2503
#define SMT1WIN_WSEL1                 2504
#define SMT1WIN_WSEL2                 2505
#define SMT1WSEL2                     2506
#define SMT1WIN_WSEL3                 2507
#define SMT1WSEL3                     2508
#define SMT1WIN_WSEL4                 2509
#define SMT1WSEL4                     2510
#define SMT2TMRL                      2511
#define SMT2TMRL_SMT2TMR              2512
#define SMT2TMR0                      2513
#define SMT2TMR1                      2514
#define SMT2TMR2                      2515
#define SMT2TMR3                      2516
#define SMT2TMR4                      2517
#define SMT2TMR5                      2518
#define SMT2TMR6                      2519
#define SMT2TMR7                      2520
#define SMT2TMRH                      2521
#define SMT2TMR8                      2522
#define SMT2TMRH_SMT2TMR              2523
#define SMT2TMR9                      2524
#define SMT2TMR10                     2525
#define SMT2TMR11                     2526
#define SMT2TMR12                     2527
#define SMT2TMR13                     2528
#define SMT2TMR14                     2529
#define SMT2TMR15                     2530
#define SMT2TMRU                      2531
#define SMT2TMR16                     2532
#define SMT2TMRU_SMT2TMR              2533
#define SMT2TMR17                     2534
#define SMT2TMR18                     2535
#define SMT2TMR19                     2536
#define SMT2TMR20                     2537
#define SMT2TMR21                     2538
#define SMT2TMR22                     2539
#define SMT2TMR23                     2540
#define SMT2CPRL                      2541
#define SMT2CPRL_SMT2CPR              2542
#define SMT2CPR0                      2543
#define SMT2CPR1                      2544
#define SMT2CPR2                      2545
#define SMT2CPR3                      2546
#define SMT2CPR4                      2547
#define SMT2CPR5                      2548
#define SMT2CPR6                      2549
#define SMT2CPR7                      2550
#define SMT2CPRH                      2551
#define SMT2CPR8                      2552
#define SMT2CPRH_SMT2CPR              2553
#define SMT2CPR9                      2554
#define SMT2CPR10                     2555
#define SMT2CPR11                     2556
#define SMT2CPR12                     2557
#define SMT2CPR13                     2558
#define SMT2CPR14                     2559
#define SMT2CPR15                     2560
#define SMT2CPRU                      2561
#define SMT2CPRU_SMT2CPR              2562
#define SMT2CPR16                     2563
#define SMT2CPR17                     2564
#define SMT2CPR18                     2565
#define SMT2CPR19                     2566
#define SMT2CPR20                     2567
#define SMT2CPR21                     2568
#define SMT2CPR22                     2569
#define SMT2CPR23                     2570
#define SMT2CPWL                      2571
#define SMT2CPWL_SMT2CPW              2572
#define SMT2CPW0                      2573
#define SMT2CPW1                      2574
#define SMT2CPW2                      2575
#define SMT2CPW3                      2576
#define SMT2CPW4                      2577
#define SMT2CPW5                      2578
#define SMT2CPW6                      2579
#define SMT2CPW7                      2580
#define SMT2CPWH                      2581
#define SMT2CPWH_SMT2CPW              2582
#define SMT2CPW8                      2583
#define SMT2CPW9                      2584
#define SMT2CPW10                     2585
#define SMT2CPW11                     2586
#define SMT2CPW12                     2587
#define SMT2CPW13                     2588
#define SMT2CPW14                     2589
#define SMT2CPW15                     2590
#define SMT2CPWU                      2591
#define SMT2CPWU_SMT2CPW              2592
#define SMT2CPW16                     2593
#define SMT2CPW17                     2594
#define SMT2CPW18                     2595
#define SMT2CPW19                     2596
#define SMT2CPW20                     2597
#define SMT2CPW21                     2598
#define SMT2CPW22                     2599
#define SMT2CPW23                     2600
#define SMT2PRL                       2601
#define SMT2PRL_SMT2PR                2602
#define SMT2PR0                       2603
#define SMT2PR1                       2604
#define SMT2PR2                       2605
#define SMT2PR3                       2606
#define SMT2PR4                       2607
#define SMT2PR5                       2608
#define SMT2PR6                       2609
#define SMT2PR7                       2610
#define SMT2PRH                       2611
#define SMT2PRH_SMT2PR                2612
#define SMT2PR8                       2613
#define SMT2PR9                       2614
#define SMT2PR10                      2615
#define SMT2PR11                      2616
#define SMT2PR12                      2617
#define SMT2PR13                      2618
#define SMT2PR14                      2619
#define SMT2PR15                      2620
#define SMT2PRU                       2621
#define SMT2PRU_SMT2PR                2622
#define SMT2PR16                      2623
#define SMT2PR17                      2624
#define SMT2PR18                      2625
#define SMT2PR19                      2626
#define SMT2PR20                      2627
#define SMT2PR21                      2628
#define SMT2PR22                      2629
#define SMT2PR23                      2630
#define SMT2CON0                      2631
#define SMT2PS0                       2632
#define SMT2PS                        2633
#define SMT2PS1                       2634
#define SMT2CON0_CPOL                 2635
#define SMT2CON0_SPOL                 2636
#define SMT2CON0_WPOL                 2637
#define SMT2CON0_STP                  2638
#define SMT2CON0_EN                   2639
#define SMT2CON1                      2640
#define SMT2CON1_MODE                 2641
#define SMT2CON1_MODE0                2642
#define SMT2MODE0                     2643
#define SMT2MODE                      2644
#define SMT2CON1_MODE1                2645
#define SMT2MODE1                     2646
#define SMT2CON1_MODE2                2647
#define SMT2MODE2                     2648
#define SMT2CON1_MODE3                2649
#define SMT2MODE3                     2650
#define SMT2REPEAT                    2651
#define SMT2CON1_REPEAT               2652
#define SMT2GO                        2653
#define SMT2STAT                      2654
#define SMT2AS                        2655
#define SMT2STAT_AS                   2656
#define SMT2WS                        2657
#define SMT2STAT_WS                   2658
#define SMT2STAT_TS                   2659
#define SMT2TS                        2660
#define SMT2RESET                     2661
#define SMT2STAT_RST                  2662
#define SMT2CPWUP                     2663
#define SMT2STAT_CPWUP                2664
#define SMT2STAT_CPRUP                2665
#define SMT2CPRUP                     2666
#define SMT2CLK                       2667
#define SMT2CLK_CSEL                  2668
#define SMT2CLK_CSEL0                 2669
#define SMT2CSEL0                     2670
#define SMT2CSEL                      2671
#define SMT2CLK_CSEL1                 2672
#define SMT2CSEL1                     2673
#define SMT2CLK_CSEL2                 2674
#define SMT2CSEL2                     2675
#define SMT2SIG                       2676
#define SMT2SIG_SSEL                  2677
#define SMT2SSEL0                     2678
#define SMT2SSEL                      2679
#define SMT2SIG_SSEL0                 2680
#define SMT2SSEL1                     2681
#define SMT2SIG_SSEL1                 2682
#define SMT2SSEL2                     2683
#define SMT2SIG_SSEL2                 2684
#define SMT2SIG_SSEL3                 2685
#define SMT2SSEL3                     2686
#define SMT2SSEL4                     2687
#define SMT2SIG_SSEL4                 2688
#define SMT2WIN                       2689
#define SMT2WIN_WSEL0                 2690
#define SMT2WSEL0                     2691
#define SMT2WSEL                      2692
#define SMT2WIN_WSEL                  2693
#define SMT2WSEL1                     2694
#define SMT2WIN_WSEL1                 2695
#define SMT2WSEL2                     2696
#define SMT2WIN_WSEL2                 2697
#define SMT2WSEL3                     2698
#define SMT2WIN_WSEL3                 2699
#define SMT2WSEL4                     2700
#define SMT2WIN_WSEL4                 2701
#define PPSLOCK                       2702
#define PPSLOCKED                     2703
#define INTPPS                        2704
#define INTPPS0                       2705
#define INTPPS1                       2706
#define INTPPS2                       2707
#define INTPPS3                       2708
#define INTPPS4                       2709
#define T0CKIPPS                      2710
#define T0CKIPPS0                     2711
#define T0CKIPPS1                     2712
#define T0CKIPPS2                     2713
#define T0CKIPPS3                     2714
#define T0CKIPPS4                     2715
#define T1CKIPPS                      2716
#define T1CKIPPS0                     2717
#define T1CKIPPS1                     2718
#define T1CKIPPS2                     2719
#define T1CKIPPS3                     2720
#define T1CKIPPS4                     2721
#define T1GPPS                        2722
#define T1GPPS0                       2723
#define T1GPPS1                       2724
#define T1GPPS2                       2725
#define T1GPPS3                       2726
#define T1GPPS4                       2727
#define CCP1PPS                       2728
#define CCP1PPS0                      2729
#define CCP1PPS1                      2730
#define CCP1PPS2                      2731
#define CCP1PPS3                      2732
#define CCP1PPS4                      2733
#define CCP2PPS                       2734
#define CCP2PPS0                      2735
#define CCP2PPS1                      2736
#define CCP2PPS2                      2737
#define CCP2PPS3                      2738
#define CCP2PPS4                      2739
#define ATINPPS                       2740
#define ATINPPS0                      2741
#define ATINPPS1                      2742
#define ATINPPS2                      2743
#define ATINPPS3                      2744
#define ATINPPS4                      2745
#define CWGINPPS                      2746
#define CWGINPPS0                     2747
#define CWGINPPS1                     2748
#define CWGINPPS2                     2749
#define CWGINPPS3                     2750
#define CWGINPPS4                     2751
#define T2PPS                         2752
#define T2PPS0                        2753
#define T2PPS1                        2754
#define T2PPS2                        2755
#define T2PPS3                        2756
#define T2PPS4                        2757
#define T3CKIPPS                      2758
#define T3CKIPPS0                     2759
#define T3CKIPPS1                     2760
#define T3CKIPPS2                     2761
#define T3CKIPPS3                     2762
#define T3CKIPPS4                     2763
#define T3GPPS                        2764
