tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1619_tdd.h
#define T3GPPS0                       2765
#define T3GPPS1                       2766
#define T3GPPS2                       2767
#define T3GPPS3                       2768
#define T3GPPS4                       2769
#define T4PPS                         2770
#define T4PPS0                        2771
#define T4PPS1                        2772
#define T4PPS2                        2773
#define T4PPS3                        2774
#define T4PPS4                        2775
#define T5CKIPPS                      2776
#define T5CKIPPS0                     2777
#define T5CKIPPS1                     2778
#define T5CKIPPS2                     2779
#define T5CKIPPS3                     2780
#define T5CKIPPS4                     2781
#define T5GPPS                        2782
#define T5GPPS0                       2783
#define T5GPPS1                       2784
#define T5GPPS2                       2785
#define T5GPPS3                       2786
#define T5GPPS4                       2787
#define T6PPS                         2788
#define T6PPS0                        2789
#define T6PPS1                        2790
#define T6PPS2                        2791
#define T6PPS3                        2792
#define T6PPS4                        2793
#define ATCC1PPS                      2794
#define ATCC1PPS0                     2795
#define ATCC1PPS1                     2796
#define ATCC1PPS2                     2797
#define ATCC1PPS3                     2798
#define ATCC1PPS4                     2799
#define SSPCLKPPS                     2800
#define SSPCLKPPS0                    2801
#define SSPCLKPPS1                    2802
#define SSPCLKPPS2                    2803
#define SSPCLKPPS3                    2804
#define SSPCLKPPS4                    2805
#define SSPDATPPS                     2806
#define SSPDATPPS0                    2807
#define SSPDATPPS1                    2808
#define SSPDATPPS2                    2809
#define SSPDATPPS3                    2810
#define SSPDATPPS4                    2811
#define SSPSSPPS                      2812
#define SSPSSPPS0                     2813
#define SSPSSPPS1                     2814
#define SSPSSPPS2                     2815
#define SSPSSPPS3                     2816
#define SSPSSPPS4                     2817
#define ATCC2PPS                      2818
#define ATCC2PPS0                     2819
#define ATCC2PPS1                     2820
#define ATCC2PPS2                     2821
#define ATCC2PPS3                     2822
#define ATCC2PPS4                     2823
#define RXPPS                         2824
#define RXPPS0                        2825
#define RXPPS1                        2826
#define RXPPS2                        2827
#define RXPPS3                        2828
#define RXPPS4                        2829
#define CKPPS                         2830
#define CKPPS0                        2831
#define CKPPS1                        2832
#define CKPPS2                        2833
#define CKPPS3                        2834
#define CKPPS4                        2835
#define SMT1SIGPPS                    2836
#define SMT1SIGPPS0                   2837
#define SMT1SIGPPS1                   2838
#define SMT1SIGPPS2                   2839
#define SMT1SIGPPS3                   2840
#define SMT1SIGPPS4                   2841
#define SMT1WINPPS                    2842
#define SMTWINPPS0                    2843
#define SMTWINPPS1                    2844
#define SMTWINPPS2                    2845
#define SMTWINPPS3                    2846
#define SMTWINPPS4                    2847
#define CLCIN0PPS                     2848
#define CLCIN0PPS0                    2849
#define CLCIN0PPS1                    2850
#define CLCIN0PPS2                    2851
#define CLCIN0PPS3                    2852
#define CLCIN0PPS4                    2853
#define CLCIN1PPS                     2854
#define CLCIN1PPS0                    2855
#define CLCIN1PPS1                    2856
#define CLCIN1PPS2                    2857
#define CLCIN1PPS3                    2858
#define CLCIN1PPS4                    2859
#define CLCIN2PPS                     2860
#define CLCIN2PPS0                    2861
#define CLCIN2PPS1                    2862
#define CLCIN2PPS2                    2863
#define CLCIN2PPS3                    2864
#define CLCIN2PPS4                    2865
#define CLCIN3PPS                     2866
#define CLCIN3PPS0                    2867
#define CLCIN3PPS1                    2868
#define CLCIN3PPS2                    2869
#define CLCIN3PPS3                    2870
#define CLCIN3PPS4                    2871
#define SMT2SIGPPS                    2872
#define SMT2SIGPPS0                   2873
#define SMT2SIGPPS1                   2874
#define SMT2SIGPPS2                   2875
#define SMT2SIGPPS3                   2876
#define SMT2SIGPPS4                   2877
#define SMT2WINPPS                    2878
#define SMT2WINPPS0                   2879
#define SMT2WINPPS1                   2880
#define SMT2WINPPS2                   2881
#define SMT2WINPPS3                   2882
#define SMT2WINPPS4                   2883
#define ATCC3PPS                      2884
#define ATCC3PPS0                     2885
#define ATCC3PPS1                     2886
#define ATCC3PPS2                     2887
#define ATCC3PPS3                     2888
#define ATCC3PPS4                     2889
#define RA0PPS                        2890
#define RA0PPS0                       2891
#define RA0PPS1                       2892
#define RA0PPS2                       2893
#define RA0PPS3                       2894
#define RA0PPS4                       2895
#define RA1PPS                        2896
#define RA1PPS0                       2897
#define RA1PPS1                       2898
#define RA1PPS2                       2899
#define RA1PPS3                       2900
#define RA1PPS4                       2901
#define RA2PPS                        2902
#define RA2PPS0                       2903
#define RA2PPS1                       2904
#define RA2PPS2                       2905
#define RA2PPS3                       2906
#define RA2PPS4                       2907
#define RA4PPS                        2908
#define RA4PPS0                       2909
#define RA4PPS1                       2910
#define RA4PPS2                       2911
#define RA4PPS3                       2912
#define RA4PPS4                       2913
#define RA5PPS                        2914
#define RA5PPS0                       2915
#define RA5PPS1                       2916
#define RA5PPS2                       2917
#define RA5PPS3                       2918
#define RA5PPS4                       2919
#define RB4PPS                        2920
#define RB4PPS0                       2921
#define RB4PPS1                       2922
#define RB4PPS2                       2923
#define RB4PPS3                       2924
#define RB4PPS4                       2925
#define RB5PPS                        2926
#define RB5PPS0                       2927
#define RB5PPS1                       2928
#define RB5PPS2                       2929
#define RB5PPS3                       2930
#define RB5PPS4                       2931
#define RB6PPS                        2932
#define RB6PPS0                       2933
#define RB6PPS1                       2934
#define RB6PPS2                       2935
#define RB6PPS3                       2936
#define RB6PPS4                       2937
#define RB7PPS                        2938
#define RB7PPS0                       2939
#define RB7PPS1                       2940
#define RB7PPS2                       2941
#define RB7PPS3                       2942
#define RB7PPS4                       2943
#define RC0PPS                        2944
#define RC0PPS0                       2945
#define RC0PPS1                       2946
#define RC0PPS2                       2947
#define RC0PPS3                       2948
#define RC0PPS4                       2949
#define RC1PPS                        2950
#define RC1PPS0                       2951
#define RC1PPS1                       2952
#define RC1PPS2                       2953
#define RC1PPS3                       2954
#define RC1PPS4                       2955
#define RC2PPS                        2956
#define RC2PPS0                       2957
#define RC2PPS1                       2958
#define RC2PPS2                       2959
#define RC2PPS3                       2960
#define RC2PPS4                       2961
#define RC3PPS                        2962
#define RC3PPS0                       2963
#define RC3PPS1                       2964
#define RC3PPS2                       2965
#define RC3PPS3                       2966
#define RC3PPS4                       2967
#define RC4PPS                        2968
#define RC4PPS0                       2969
#define RC4PPS1                       2970
#define RC4PPS2                       2971
#define RC4PPS3                       2972
#define RC4PPS4                       2973
#define RC5PPS                        2974
#define RC5PPS0                       2975
#define RC5PPS1                       2976
#define RC5PPS2                       2977
#define RC5PPS3                       2978
#define RC5PPS4                       2979
#define RC6PPS                        2980
#define RC6PPS0                       2981
#define RC6PPS1                       2982
#define RC6PPS2                       2983
#define RC6PPS3                       2984
#define RC6PPS4                       2985
#define RC7PPS                        2986
#define RC7PPS0                       2987
#define RC7PPS1                       2988
#define RC7PPS2                       2989
#define RC7PPS3                       2990
#define RC7PPS4                       2991
#define CLCDATA                       2992
#define MLC1OUT                       2993
#define MLC2OUT                       2994
#define MLC3OUT                       2995
#define MLC4OUT                       2996
#define CLC1CON                       2997
#define CLC1CON_MODE                  2998
#define LC1MODE0                      2999
#define LC1MODE                       3000
#define CLC1CON_MODE0                 3001
#define LC1MODE1                      3002
#define CLC1CON_MODE1                 3003
#define LC1MODE2                      3004
#define CLC1CON_MODE2                 3005
#define LC1INTN                       3006
#define CLC1CON_INTN                  3007
#define LC1INTP                       3008
#define CLC1CON_INTP                  3009
#define LC1OUT                        3010
#define CLC1CON_OUT                   3011
#define LC1EN                         3012
#define CLC1CON_EN                    3013
#define CLC1POL                       3014
#define LC1G1POL                      3015
#define CLC1POL_G1POL                 3016
#define CLC1POL_G2POL                 3017
#define LC1G2POL                      3018
#define LC1G3POL                      3019
#define CLC1POL_G3POL                 3020
#define LC1G4POL                      3021
#define CLC1POL_G4POL                 3022
#define CLC1POL_POL                   3023
#define LC1POL                        3024
#define CLC1SEL0                      3025
#define CLC1SEL0_D1S0                 3026
#define LC1D1S0                       3027
#define CLC1SEL0_D1S                  3028
#define LC1D1S                        3029
#define CLC1SEL0_D1S1                 3030
#define LC1D1S1                       3031
#define CLC1SEL0_D1S2                 3032
#define LC1D1S2                       3033
#define LC1D1S3                       3034
#define CLC1SEL0_D1S3                 3035
#define CLC1SEL0_D1S4                 3036
#define LC1D1S4                       3037
#define CLC1SEL0_D1S5                 3038
#define LC1D1S5                       3039
#define CLC1SEL1                      3040
#define CLC1SEL1_D2S0                 3041
#define CLC1SEL1_D2S                  3042
#define LC1D2S                        3043
#define LC1D2S0                       3044
#define CLC1SEL1_D2S1                 3045
#define LC1D2S1                       3046
#define CLC1SEL1_D2S2                 3047
#define LC1D2S2                       3048
#define LC1D2S3                       3049
#define CLC1SEL1_D2S3                 3050
#define LC1D2S4                       3051
#define CLC1SEL1_D2S4                 3052
#define LC1D2S5                       3053
#define CLC1SEL1_D2S5                 3054
#define CLC1SEL2                      3055
#define LC1D3S0                       3056
#define CLC1SEL2_D3S                  3057
#define LC1D3S                        3058
#define CLC1SEL2_D3S0                 3059
#define LC1D3S1                       3060
#define CLC1SEL2_D3S1                 3061
#define LC1D3S2                       3062
#define CLC1SEL2_D3S2                 3063
#define LC1D3S3                       3064
#define CLC1SEL2_D3S3                 3065
#define LC1D3S4                       3066
#define CLC1SEL2_D3S4                 3067
#define LC1D3S5                       3068
#define CLC1SEL2_D3S5                 3069
#define CLC1SEL3                      3070
#define CLC1SEL3_D4S                  3071
#define LC1D4S                        3072
#define LC1D4S0                       3073
#define CLC1SEL3_D4S0                 3074
#define CLC1SEL3_D4S1                 3075
#define LC1D4S1                       3076
#define LC1D4S2                       3077
#define CLC1SEL3_D4S2                 3078
#define LC1D4S3                       3079
#define CLC1SEL3_D4S3                 3080
#define LC1D4S4                       3081
#define CLC1SEL3_D4S4                 3082
#define LC1D4S5                       3083
#define CLC1SEL3_D4S5                 3084
#define CLC1GLS0                      3085
#define CLC1GLS0_D1N                  3086
#define LC1G1D1N                      3087
#define CLC1GLS0_D1T                  3088
#define LC1G1D1T                      3089
#define LC1G1D2N                      3090
#define CLC1GLS0_D2N                  3091
#define LC1G1D2T                      3092
#define CLC1GLS0_D2T                  3093
#define CLC1GLS0_D3N                  3094
#define LC1G1D3N                      3095
#define CLC1GLS0_D3T                  3096
#define LC1G1D3T                      3097
#define CLC1GLS0_D4N                  3098
#define LC1G1D4N                      3099
#define CLC1GLS0_D4T                  3100
#define LC1G1D4T                      3101
#define CLC1GLS1                      3102
#define CLC1GLS1_D1N                  3103
#define LC1G2D1N                      3104
#define LC1G2D1T                      3105
#define CLC1GLS1_D1T                  3106
#define CLC1GLS1_D2N                  3107
#define LC1G2D2N                      3108
#define LC1G2D2T                      3109
#define CLC1GLS1_D2T                  3110
#define CLC1GLS1_D3N                  3111
#define LC1G2D3N                      3112
#define LC1G2D3T                      3113
#define CLC1GLS1_D3T                  3114
#define CLC1GLS1_D4N                  3115
#define LC1G2D4N                      3116
#define LC1G2D4T                      3117
#define CLC1GLS1_D4T                  3118
#define CLC1GLS2                      3119
#define CLC1GLS2_D1N                  3120
#define LC1G3D1N                      3121
#define LC1G3D1T                      3122
#define CLC1GLS2_D1T                  3123
#define LC1G3D2N                      3124
#define CLC1GLS2_D2N                  3125
#define LC1G3D2T                      3126
#define CLC1GLS2_D2T                  3127
#define CLC1GLS2_D3N                  3128
#define LC1G3D3N                      3129
#define LC1G3D3T                      3130
#define CLC1GLS2_D3T                  3131
#define LC1G3D4N                      3132
#define CLC1GLS2_D4N                  3133
#define LC1G3D4T                      3134
#define CLC1GLS2_D4T                  3135
#define CLC1GLS3                      3136
#define LC1G4D1N                      3137
#define CLC1GLS3_G4D1N                3138
#define LC1G4D1T                      3139
#define CLC1GLS3_G4D1T                3140
#define CLC1GLS3_G4D2N                3141
#define LC1G4D2N                      3142
#define CLC1GLS3_G4D2T                3143
#define LC1G4D2T                      3144
#define LC1G4D3N                      3145
#define CLC1GLS3_G4D3N                3146
#define LC1G4D3T                      3147
#define CLC1GLS3_G4D3T                3148
#define CLC1GLS3_G4D4N                3149
#define LC1G4D4N                      3150
#define CLC1GLS3_G4D4T                3151
#define LC1G4D4T                      3152
#define CLC2CON                       3153
#define LC2MODE0                      3154
#define CLC2CON_MODE                  3155
#define LC2MODE                       3156
#define CLC2CON_MODE0                 3157
#define LC2MODE1                      3158
#define CLC2CON_MODE1                 3159
#define LC2MODE2                      3160
#define CLC2CON_MODE2                 3161
#define LC2INTN                       3162
#define CLC2CON_INTN                  3163
#define LC2INTP                       3164
#define CLC2CON_INTP                  3165
#define CLC2CON_OUT                   3166
#define LC2OUT                        3167
#define CLC2CON_EN                    3168
#define LC2EN                         3169
#define CLC2POL                       3170
#define LC2G1POL                      3171
#define CLC2POL_G1POL                 3172
#define LC2G2POL                      3173
#define CLC2POL_G2POL                 3174
#define LC2G3POL                      3175
#define CLC2POL_G3POL                 3176
#define LC2G4POL                      3177
#define CLC2POL_G4POL                 3178
#define CLC2POL_POL                   3179
#define LC2POL                        3180
#define CLC2SEL0                      3181
#define CLC2SEL0_D1S                  3182
#define LC2D1S0                       3183
#define CLC2SEL0_D1S0                 3184
#define LC2D1S                        3185
#define LC2D1S1                       3186
#define CLC2SEL0_D1S1                 3187
#define LC2D1S2                       3188
#define CLC2SEL0_D1S2                 3189
#define CLC2SEL0_D1S3                 3190
#define LC2D1S3                       3191
#define LC2D1S4                       3192
#define CLC2SEL0_D1S4                 3193
#define LC2D1S5                       3194
#define CLC2SEL0_D1S5                 3195
#define CLC2SEL1                      3196
#define LC2D2S0                       3197
#define CLC2SEL1_D2S0                 3198
#define LC2D2S                        3199
#define CLC2SEL1_D2S                  3200
#define LC2D2S1                       3201
#define CLC2SEL1_D2S1                 3202
#define LC2D2S2                       3203
#define CLC2SEL1_D2S2                 3204
#define LC2D2S3                       3205
#define CLC2SEL1_D2S3                 3206
#define LC2D2S4                       3207
#define CLC2SEL1_D2S4                 3208
#define LC2D2S5                       3209
#define CLC2SEL1_D2S5                 3210
#define CLC2SEL2                      3211
#define CLC2SEL2_D3S                  3212
#define LC2D3S0                       3213
#define CLC2SEL2_D3S0                 3214
#define LC2D3S                        3215
#define CLC2SEL2_D3S1                 3216
#define LC2D3S1                       3217
#define LC2D3S2                       3218
#define CLC2SEL2_D3S2                 3219
#define LC2D3S3                       3220
#define CLC2SEL2_D3S3                 3221
#define LC2D3S4                       3222
#define CLC2SEL2_D3S4                 3223
#define LC2D3S5                       3224
#define CLC2SEL2_D3S5                 3225
#define CLC2SEL3                      3226
#define LC2D4S0                       3227
#define CLC2SEL3_D4S                  3228
#define CLC2SEL3_D4S0                 3229
#define LC2D4S                        3230
#define LC2D4S1                       3231
#define CLC2SEL3_D4S1                 3232
#define LC2D4S2                       3233
#define CLC2SEL3_D4S2                 3234
#define CLC2SEL3_D4S3                 3235
#define LC2D4S3                       3236
#define LC2D4S4                       3237
#define CLC2SEL3_D4S4                 3238
#define LC2D4S5                       3239
#define CLC2SEL3_D4S5                 3240
#define CLC2GLS0                      3241
#define LC2G1D1N                      3242
#define CLC2GLS0_D1N                  3243
#define CLC2GLS0_D1T                  3244
#define LC2G1D1T                      3245
#define LC2G1D2N                      3246
#define CLC2GLS0_D2N                  3247
#define CLC2GLS0_D2T                  3248
#define LC2G1D2T                      3249
#define LC2G1D3N                      3250
#define CLC2GLS0_D3N                  3251
#define CLC2GLS0_D3T                  3252
#define LC2G1D3T                      3253
#define LC2G1D4N                      3254
#define CLC2GLS0_D4N                  3255
#define CLC2GLS0_D4T                  3256
#define LC2G1D4T                      3257
#define CLC2GLS1                      3258
#define CLC2GLS1_D1N                  3259
#define LC2G2D1N                      3260
#define CLC2GLS1_D1T                  3261
#define LC2G2D1T                      3262
#define CLC2GLS1_D2N                  3263
#define LC2G2D2N                      3264
#define CLC2GLS1_D2T                  3265
#define LC2G2D2T                      3266
#define LC2G2D3N                      3267
#define CLC2GLS1_D3N                  3268
#define LC2G2D3T                      3269
#define CLC2GLS1_D3T                  3270
#define LC2G2D4N                      3271
#define CLC2GLS1_D4N                  3272
#define LC2G2D4T                      3273
#define CLC2GLS1_D4T                  3274
#define CLC2GLS2                      3275
#define LC2G3D1N                      3276
#define CLC2GLS2_D1N                  3277
#define CLC2GLS2_D1T                  3278
#define LC2G3D1T                      3279
#define CLC2GLS2_D2N                  3280
#define LC2G3D2N                      3281
#define LC2G3D2T                      3282
#define CLC2GLS2_D2T                  3283
#define CLC2GLS2_D3N                  3284
#define LC2G3D3N                      3285
#define CLC2GLS2_D3T                  3286
#define LC2G3D3T                      3287
#define CLC2GLS2_D4N                  3288
#define LC2G3D4N                      3289
#define LC2G3D4T                      3290
#define CLC2GLS2_D4T                  3291
#define CLC2GLS3                      3292
#define LC2G4D1N                      3293
#define CLC2GLS3_G4D1N                3294
#define CLC2GLS3_G4D1T                3295
#define LC2G4D1T                      3296
#define CLC2GLS3_G4D2N                3297
#define LC2G4D2N                      3298
#define LC2G4D2T                      3299
#define CLC2GLS3_G4D2T                3300
#define CLC2GLS3_G4D3N                3301
#define LC2G4D3N                      3302
#define CLC2GLS3_G4D3T                3303
#define LC2G4D3T                      3304
#define LC2G4D4N                      3305
#define CLC2GLS3_G4D4N                3306
#define CLC2GLS3_G4D4T                3307
#define LC2G4D4T                      3308
#define CLC3CON                       3309
#define LC3MODE0                      3310
#define CLC3CON_MODE0                 3311
#define CLC3CON_MODE                  3312
#define LC3MODE                       3313
#define LC3MODE1                      3314
#define CLC3CON_MODE1                 3315
#define LC3MODE2                      3316
#define CLC3CON_MODE2                 3317
#define LC3INTN                       3318
#define CLC3CON_INTN                  3319
#define CLC3CON_INTP                  3320
#define LC3INTP                       3321
#define CLC3CON_OUT                   3322
