tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1619_tdd.h
#define LC3OUT                        3323
#define LC3EN                         3324
#define CLC3CON_EN                    3325
#define CLC3POL                       3326
#define LC3G1POL                      3327
#define CLC3POL_G1POL                 3328
#define LC3G2POL                      3329
#define CLC3POL_G2POL                 3330
#define CLC3POL_G3POL                 3331
#define LC3G3POL                      3332
#define LC3G4POL                      3333
#define CLC3POL_G4POL                 3334
#define LC3POL                        3335
#define CLC3POL_POL                   3336
#define CLC3SEL0                      3337
#define CLC3SEL0_D1S0                 3338
#define LC3D1S0                       3339
#define CLC3SEL0_D1S                  3340
#define LC3D1S                        3341
#define LC3D1S1                       3342
#define CLC3SEL0_D1S1                 3343
#define LC3D1S2                       3344
#define CLC3SEL0_D1S2                 3345
#define LC3D1S3                       3346
#define CLC3SEL0_D1S3                 3347
#define LC3D1S4                       3348
#define CLC3SEL0_D1S4                 3349
#define LC3D1S5                       3350
#define CLC3SEL0_D1S5                 3351
#define CLC3SEL1                      3352
#define CLC3SEL1_D2S                  3353
#define CLC3SEL1_D2S0                 3354
#define LC3D2S                        3355
#define LC3D2S0                       3356
#define CLC3SEL1_D2S1                 3357
#define LC3D2S1                       3358
#define CLC3SEL1_D2S2                 3359
#define LC3D2S2                       3360
#define CLC3SEL1_D2S3                 3361
#define LC3D2S3                       3362
#define CLC3SEL1_D2S4                 3363
#define LC3D2S4                       3364
#define CLC3SEL1_D2S5                 3365
#define LC3D2S5                       3366
#define CLC3SEL2                      3367
#define LC3D3S                        3368
#define CLC3SEL2_D3S                  3369
#define LC3D3S0                       3370
#define CLC3SEL2_D3S0                 3371
#define LC3D3S1                       3372
#define CLC3SEL2_D3S1                 3373
#define LC3D3S2                       3374
#define CLC3SEL2_D3S2                 3375
#define LC3D3S3                       3376
#define CLC3SEL2_D3S3                 3377
#define CLC3SEL2_D3S4                 3378
#define LC3D3S4                       3379
#define CLC3SEL2_D3S5                 3380
#define LC3D3S5                       3381
#define CLC3SEL3                      3382
#define CLC3SEL3_D4S0                 3383
#define LC3D4S0                       3384
#define CLC3SEL3_D4S                  3385
#define LC3D4S                        3386
#define LC3D4S1                       3387
#define CLC3SEL3_D4S1                 3388
#define LC3D4S2                       3389
#define CLC3SEL3_D4S2                 3390
#define LC3D4S3                       3391
#define CLC3SEL3_D4S3                 3392
#define LC3D4S4                       3393
#define CLC3SEL3_D4S4                 3394
#define LC3D4S5                       3395
#define CLC3SEL3_D4S5                 3396
#define CLC3GLS0                      3397
#define CLC3GLS0_D1N                  3398
#define LC3G1D1N                      3399
#define LC3G1D1T                      3400
#define CLC3GLS0_D1T                  3401
#define LC3G1D2N                      3402
#define CLC3GLS0_D2N                  3403
#define CLC3GLS0_D2T                  3404
#define LC3G1D2T                      3405
#define CLC3GLS0_D3N                  3406
#define LC3G1D3N                      3407
#define LC3G1D3T                      3408
#define CLC3GLS0_D3T                  3409
#define CLC3GLS0_D4N                  3410
#define LC3G1D4N                      3411
#define CLC3GLS0_D4T                  3412
#define LC3G1D4T                      3413
#define CLC3GLS1                      3414
#define LC3G2D1N                      3415
#define CLC3GLS1_D1N                  3416
#define CLC3GLS1_D1T                  3417
#define LC3G2D1T                      3418
#define LC3G2D2N                      3419
#define CLC3GLS1_D2N                  3420
#define LC3G2D2T                      3421
#define CLC3GLS1_D2T                  3422
#define LC3G2D3N                      3423
#define CLC3GLS1_D3N                  3424
#define CLC3GLS1_D3T                  3425
#define LC3G2D3T                      3426
#define LC3G2D4N                      3427
#define CLC3GLS1_D4N                  3428
#define LC3G2D4T                      3429
#define CLC3GLS1_D4T                  3430
#define CLC3GLS2                      3431
#define LC3G3D1N                      3432
#define CLC3GLS2_D1N                  3433
#define LC3G3D1T                      3434
#define CLC3GLS2_D1T                  3435
#define CLC3GLS2_D2N                  3436
#define LC3G3D2N                      3437
#define CLC3GLS2_D2T                  3438
#define LC3G3D2T                      3439
#define CLC3GLS2_D3N                  3440
#define LC3G3D3N                      3441
#define LC3G3D3T                      3442
#define CLC3GLS2_D3T                  3443
#define CLC3GLS2_D4N                  3444
#define LC3G3D4N                      3445
#define CLC3GLS2_D4T                  3446
#define LC3G3D4T                      3447
#define CLC3GLS3                      3448
#define LC3G4D1N                      3449
#define CLC3GLS3_G4D1N                3450
#define LC3G4D1T                      3451
#define CLC3GLS3_G4D1T                3452
#define LC3G4D2N                      3453
#define CLC3GLS3_G4D2N                3454
#define CLC3GLS3_G4D2T                3455
#define LC3G4D2T                      3456
#define LC3G4D3N                      3457
#define CLC3GLS3_G4D3N                3458
#define CLC3GLS3_G4D3T                3459
#define LC3G4D3T                      3460
#define LC3G4D4N                      3461
#define CLC3GLS3_G4D4N                3462
#define LC3G4D4T                      3463
#define CLC3GLS3_G4D4T                3464
#define CLC4CON                       3465
#define LC4MODE                       3466
#define CLC4CON_MODE                  3467
#define LC4MODE0                      3468
#define CLC4CON_MODE0                 3469
#define LC4MODE1                      3470
#define CLC4CON_MODE1                 3471
#define LC4MODE2                      3472
#define CLC4CON_MODE2                 3473
#define LC4INTN                       3474
#define CLC4CON_INTN                  3475
#define CLC4CON_INTP                  3476
#define LC4INTP                       3477
#define CLC4CON_OUT                   3478
#define LC4OUT                        3479
#define CLC4CON_EN                    3480
#define LC4EN                         3481
#define CLC4POL                       3482
#define CLC4POL_G1POL                 3483
#define LC4G1POL                      3484
#define CLC4POL_G2POL                 3485
#define LC4G2POL                      3486
#define CLC4POL_G3POL                 3487
#define LC4G3POL                      3488
#define LC4G4POL                      3489
#define CLC4POL_G4POL                 3490
#define LC4POL                        3491
#define CLC4POL_POL                   3492
#define CLC4SEL0                      3493
#define CLC4SEL0_D1S0                 3494
#define LC4D1S0                       3495
#define CLC4SEL0_D1S                  3496
#define LC4D1S                        3497
#define CLC4SEL0_D1S1                 3498
#define LC4D1S1                       3499
#define CLC4SEL0_D1S2                 3500
#define LC4D1S2                       3501
#define CLC4SEL0_D1S3                 3502
#define LC4D1S3                       3503
#define CLC4SEL0_D1S4                 3504
#define LC4D1S4                       3505
#define CLC4SEL0_D1S5                 3506
#define LC4D1S5                       3507
#define CLC4SEL1                      3508
#define LC4D2S0                       3509
#define CLC4SEL1_D2S                  3510
#define CLC4SEL1_D2S0                 3511
#define LC4D2S                        3512
#define CLC4SEL1_D2S1                 3513
#define LC4D2S1                       3514
#define LC4D2S2                       3515
#define CLC4SEL1_D2S2                 3516
#define LC4D2S3                       3517
#define CLC4SEL1_D2S3                 3518
#define LC4D2S4                       3519
#define CLC4SEL1_D2S4                 3520
#define LC4D2S5                       3521
#define CLC4SEL1_D2S5                 3522
#define CLC4SEL2                      3523
#define LC4D3S                        3524
#define CLC4SEL2_D3S                  3525
#define CLC4SEL2_D3S0                 3526
#define LC4D3S0                       3527
#define LC4D3S1                       3528
#define CLC4SEL2_D3S1                 3529
#define CLC4SEL2_D3S2                 3530
#define LC4D3S2                       3531
#define CLC4SEL2_D3S3                 3532
#define LC4D3S3                       3533
#define CLC4SEL2_D3S4                 3534
#define LC4D3S4                       3535
#define CLC4SEL2_D3S5                 3536
#define LC4D3S5                       3537
#define CLC4SEL3                      3538
#define LC4D4S0                       3539
#define LC4D4S                        3540
#define CLC4SEL3_D4S0                 3541
#define CLC4SEL3_D4S                  3542
#define LC4D4S1                       3543
#define CLC4SEL3_D4S1                 3544
#define LC4D4S2                       3545
#define CLC4SEL3_D4S2                 3546
#define LC4D4S3                       3547
#define CLC4SEL3_D4S3                 3548
#define LC4D4S4                       3549
#define CLC4SEL3_D4S4                 3550
#define LC4D4S5                       3551
#define CLC4SEL3_D4S5                 3552
#define CLC4GLS0                      3553
#define CLC4GLS0_D1N                  3554
#define LC4G1D1N                      3555
#define CLC4GLS0_D1T                  3556
#define LC4G1D1T                      3557
#define CLC4GLS0_D2N                  3558
#define LC4G1D2N                      3559
#define CLC4GLS0_D2T                  3560
#define LC4G1D2T                      3561
#define CLC4GLS0_D3N                  3562
#define LC4G1D3N                      3563
#define CLC4GLS0_D3T                  3564
#define LC4G1D3T                      3565
#define CLC4GLS0_D4N                  3566
#define LC4G1D4N                      3567
#define CLC4GLS0_D4T                  3568
#define LC4G1D4T                      3569
#define CLC4GLS1                      3570
#define CLC4GLS1_D1N                  3571
#define LC4G2D1N                      3572
#define CLC4GLS1_D1T                  3573
#define LC4G2D1T                      3574
#define LC4G2D2N                      3575
#define CLC4GLS1_D2N                  3576
#define LC4G2D2T                      3577
#define CLC4GLS1_D2T                  3578
#define CLC4GLS1_D3N                  3579
#define LC4G2D3N                      3580
#define LC4G2D3T                      3581
#define CLC4GLS1_D3T                  3582
#define CLC4GLS1_D4N                  3583
#define LC4G2D4N                      3584
#define CLC4GLS1_D4T                  3585
#define LC4G2D4T                      3586
#define CLC4GLS2                      3587
#define CLC4GLS2_D1N                  3588
#define LC4G3D1N                      3589
#define CLC4GLS2_D1T                  3590
#define LC4G3D1T                      3591
#define LC4G3D2N                      3592
#define CLC4GLS2_D2N                  3593
#define LC4G3D2T                      3594
#define CLC4GLS2_D2T                  3595
#define CLC4GLS2_D3N                  3596
#define LC4G3D3N                      3597
#define CLC4GLS2_D3T                  3598
#define LC4G3D3T                      3599
#define LC4G3D4N                      3600
#define CLC4GLS2_D4N                  3601
#define LC4G3D4T                      3602
#define CLC4GLS2_D4T                  3603
#define CLC4GLS3                      3604
#define CLC4GLS3_G4D1N                3605
#define LC4G4D1N                      3606
#define LC4G4D1T                      3607
#define CLC4GLS3_G4D1T                3608
#define LC4G4D2N                      3609
#define CLC4GLS3_G4D2N                3610
#define LC4G4D2T                      3611
#define CLC4GLS3_G4D2T                3612
#define CLC4GLS3_G4D3N                3613
#define LC4G4D3N                      3614
#define CLC4GLS3_G4D3T                3615
#define LC4G4D3T                      3616
#define LC4G4D4N                      3617
#define CLC4GLS3_G4D4N                3618
#define LC4G4D4T                      3619
#define CLC4GLS3_G4D4T                3620
#define STATUS_SHAD                   3621
#define C_SHAD                        3622
#define DC_SHAD                       3623
#define Z_SHAD                        3624
#define WREG_SHAD                     3625
#define BSR_SHAD                      3626
#define PCLATH_SHAD                   3627
#define FSR0L_SHAD                    3628
#define FSR0H_SHAD                    3629
#define FSR1L_SHAD                    3630
#define FSR1H_SHAD                    3631
#define STKPTR                        3632
#define TOSL                          3633
#define TOSH                          3634

#endif // _PIC16LF1619_H_
